

#define DEBUG 4

#include <string.h>
#include <fapi/reg_bm.h>
#include <fapi/reg_ddrramif.h>
#include <fapi/reg_vd.h>
#include <fapi/reg_vd_ext.h>
#include <fapi/reg_vo.h>
#include <fapi/sys_services.h>
#include <fapi/drv_boot.h>
//#include <fapi/board_ifc.h>
#include <fapi/drv_timer.h>
#include <fapi/drv_vienc.h>
#include <fapi/drv_vienc_priv.h>
#include <fapi/drv_videc.h>
#include <fapi/drv_videc_priv.h>


uint32_t Data_21e01a08[] = //21e01a08
{
 0x00000000, 0x00000340, 0x00000680, 0x000009c0,
 0x00000d00, 0x00001040, 0x00001380, 0x000016c0,
 0x00001a00, 0x00002000, 0x00002340, 0x00002680,
 0x000029c0, 0x00002d00, 0x00003040, 0x00003380,
 0x000036c0, 0x00003a00, 0x00004000, 0x00004340,
 0x00004680, 0x000049c0,
};

uint32_t Data_21e01a60[] = //21e01a60
{
 0x00000000, 0x00000270,
 0x000004e0, 0x00000750, 0x000009c0, 0x00000c30,
 0x00000ea0, 0x00001110, 0x00001380, 0x000015f0,
 0x00001860, 0x00001ad0, 0x00001d40, 0x00002000,
 0x00002270, 0x000024e0, 0x00002750, 0x000029c0,
 0x00002c30, 0x00002ea0, 0x00003110, 0x00003380,
};

uint32_t Data_21e01ab8[] = //21e01ab8
{
 0x00000000, 0x00000168, 0x000002d0, 0x00000438,
 0x000005a0, 0x00000708, 0x00000870, 0x000009d8,
 0x00000b40, 0x00000ca8, 0x00000e10, 0x00000f78,
 0x000010e0, 0x00001248, 0x000013b0, 0x00001518,
 0x00001680, 0x000017e8, 0x00001950, 0x00001ab8,
 0x00001c20, 0x00001d88,
};

uint32_t Data_21e01b10[] = //21e01b10
{
 0x00000000, 0x000000a8,
 0x00000150, 0x000001f8, 0x000002a0, 0x00000348,
 0x000003f0, 0x00000498, 0x00000540, 0x000005e8,
 0x00000690, 0x00000738, 0x000007e0, 0x00000888,
 0x00000930, 0x000009d8, 0x00000a80, 0x00000b28,
 0x00000bd0, 0x00000c78, 0x00000d20, 0x00000dc8,
};


struct Struct_21efc808
{
   int Data_0; //0
   int Data_4; //4
   int Data_8; //8
   int Data_12; //12
   int Data_16; //16
   int32_t Data_20; //20

};

struct Struct_21efc808 Data_21efc808 = //21efc808
{
      0, 0, 0, 0, 0, -28138
};

struct Struct_21efc820
{
   int fill_0; //0
   unsigned mpeg2Version; //4
   unsigned h264Version; //8
   int fill_12; //12
   int fill_16; //16
};

struct Struct_21efc820 Data_21efc820 = //21efc820
{
   -1,
   0x4d31001b,
   0x48312004,
   0x5631,
   0x4131
};

int FAPI_VIDEC_MAX_VIDEO_STREAM_BUFFER_SIZE[] = //21b6b934
{
      0,
      0x3ffc00,
      0x7ffc00
};



FAPI_SYS_DriverT FAPI_VIDEC_Driver0 = //21efc834
{
      "VIDEC0",
      28, //FAPI_INTR_DISP0
      FAPI_SYS_BSR_EXEC_THREAD,
      FAPI_VIDEC_Init,
      FAPI_VIDEC_Exit,
      FAPI_VIDEC_IsrDisplay0,
      FAPI_VIDEC_BsrDisplay0,
      0x800,
      0x100,
};


FAPI_SYS_DriverT FAPI_VIDEC_Driver1 = //21efc858
{
      "VIDEC0",
      18, //FAPI_INTR_AMCPU_AXP
      FAPI_SYS_BSR_EXEC_THREAD,
      FAPI_VIDEC_Init,
      FAPI_VIDEC_Exit,
      FAPI_VIDEC_IsrDecode0,
      FAPI_VIDEC_BsrDecode0,
      0x800,
      0x100,
};


int videcDriverIsInitialized = 0; //21f67030
int videcDriverLoadFirmwaresState = 0; //21f67034
int32_t videoDriverLoadFirmwareErrorCode = 0; //21f67038
uint32_t videc0HandleAllocated = 0; //21f67040
FAPI_SYS_SemaphoreT videcSemaphore = 0; //21f6703c
uint32_t fvm0la = 0; //21f67044
uint32_t fvm1la = 0; //21f67048
uint32_t fvm2la = 0; //21f6704c

uint32_t fvm0sz = 0; //21f67050
uint32_t fvm1sz = 0; //21f67054
uint32_t fvm2sz = 0; //21f67058

uint32_t fvh0la = 0; //21f6705c
uint32_t fvh1la = 0; //21f67060
uint32_t fvh2la = 0; //21f67064

uint32_t fvh0sz = 0; //21f67068
uint32_t fvh1sz = 0; //21f6706c
uint32_t fvh2sz = 0; //21f67070

FAPI_VIDEC_VideoDecoderMemoryDataT videcMemoryData[1]; //21f67074

FAPI_VIDEC_VideoDecoderHandleT videcHandles[1]; //21f67164

struct Struct_21bf62c8
{
   int fill_0[33788]; //0
   //135152
};

//struct Struct_21bf62c8
FAPI_VIDEC_VideoDecoderIsrDataT videcIsrData[1]; //21fbea84

FAPI_VIDEC_VideoDecoderHandleT* Data_21f67278; //21f67278


int fapi_videc_set_start_addresses(FAPI_VIDEC_VideoDecoderHandleT*);
int fapi_videc_boot_pcpu(FAPI_VIDEC_VideoDecoderHandleT*);
int32_t fapi_videc_update_buffer_info(FAPI_VIDEC_VideoDecoderIsrDataT*);
void fapi_videc_set_frame_info_fill_level(FAPI_VIDEC_VideoDecoderIsrDataT*);
void fapi_videc_set_aud_info_fill_level(FAPI_VIDEC_VideoDecoderIsrDataT*);
void func_21c4894c(FAPI_VIDEC_VideoDecoderIsrDataT*);
void fapi_videc_clear_aud_info_data(FAPI_VIDEC_VideoDecoderIsrDataT*);
void fapi_videc_clear_entropy_decoding_data(FAPI_VIDEC_VideoDecoderIsrDataT*);

static int32_t videcDriverLoadFirmwares(void);


/* 21c4e204 - todo */
void func_21c4e204(FAPI_VIDEC_VideoDecoderIsrDataT* a)
{
//   FAPI_SYS_PRINT_MSG("func_21c4e204\n");
}


static void func_21927d84(FAPI_VIDEC_VideoDecoderIsrDataT* isrDataPtr)
{
   //21c4eff8
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].serialNum=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].serialNum);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].displayFrameBank=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayFrameBank);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].displayWidth=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayWidth);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].displayHeight=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayHeight);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].decodedWidth=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedWidth);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].decodedHeight=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedHeight);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].displayOrderInfo=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].topFieldSerialNo=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].topFieldSerialNo);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].botFieldSerialNo=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].botFieldSerialNo);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].ptsValidFlag=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].ptsValidFlag);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].dtsValidFlag=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].dtsValidFlag);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].pts=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].pts);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].dts=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].dts);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].state=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].state);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].topDecError=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].topDecError);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].botDecError=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].botDecError);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].vdpbDispCount=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].vdpbDispCount);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].decodedPicAspectRatio=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedPicAspectRatio);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].activePicAspectRatioL0=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].activePicAspectRatioL0);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].activePicAspectRatioL1=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].activePicAspectRatioL1);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].afdUserDataActiveFormatFlag=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].afdUserDataActiveFormatFlag);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].currAfd=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].currAfd);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].codedInterlaceProggState=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].codedInterlaceProggState);
   FAPI_SYS_PRINT_DEBUG(6, "[VIDEC] func_21927d84: isrDataPtr->frameInfo.decodedPic[%d].readoutInterlaceProggState=%d\n",
         isrDataPtr->frameInfo.rPtr,
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].readoutInterlaceProggState);

   isrDataPtr->frameCrop.currAfd = //705360
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].currAfd; //84
   isrDataPtr->frameCrop.topFieldSerialNo = //705352
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].topFieldSerialNo; //28
   isrDataPtr->frameCrop.botFieldSerialNo = //705356
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].botFieldSerialNo; //32
   isrDataPtr->frameBank = //705304
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayFrameBank; //4
   isrDataPtr->frameDisplayOrderInfo = //705380
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo; //24
   isrDataPtr->frameTopFieldNo = //705384
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].topFieldSerialNo; //28
   isrDataPtr->frameBotFieldNo = //705388
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].botFieldSerialNo; //32
   isrDataPtr->frameSerialNum = //705392
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].serialNum; //0
   isrDataPtr->frameCrop.aspectRatio = //705308
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedPicAspectRatio; //68
   isrDataPtr->frameIdx = //705396
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].vdpbDispCount; //64
   isrDataPtr->frameCrop.activeAspectRatioL0 = //705312
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].activePicAspectRatioL0; //72
   isrDataPtr->frameCrop.codedInterlaceProggState = //705364
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].codedInterlaceProggState; //88
   isrDataPtr->frameCrop.activeAspectRatioL1 = //705316
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].activePicAspectRatioL1; //76
   isrDataPtr->frameCrop.readoutInterlaceProggState = //705368
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].readoutInterlaceProggState; //92
   isrDataPtr->frameCrop.mpegIFrameState = //705372
         isrDataPtr->mpegIFrameState; //188;

   if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedWidth != 0) //698760=16
   {
      //21c4f100
      if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedWidth <
            isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayWidth)
      {
         isrDataPtr->frameCrop.decodedWidth = //705344
            isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedWidth;
      }
      else
      {
         isrDataPtr->frameCrop.decodedWidth = //705344
            isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayWidth;
      }
   }
   else
   {
      //->21c4f72c
      isrDataPtr->frameCrop.decodedWidth = //705344
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayWidth; //8
      //->21c4f11c
   }
   //21c4f11c
   if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedHeight != 0) //698764=20
   {
      //21c4f144
      if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedHeight <
            isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayHeight)
      {
         isrDataPtr->frameCrop.decodedHeight = //705348
            isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedHeight;
      }
      else
      {
         isrDataPtr->frameCrop.decodedHeight = //705348
            isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayHeight;
      }
   }
   else
   {
      //->21c4f718
      isrDataPtr->frameCrop.decodedHeight = //705348
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayHeight; //698756=12
      //->21c4f160
   }
   //21c4f160
   isrDataPtr->vesInfo.displayWidth =
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayWidth;
   isrDataPtr->vesInfo.displayHeight =
      isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayHeight;

   if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 2)
   {
      //->21c4f908
      isrDataPtr->frameCrop.frameField = 0;
      isrDataPtr->frameCrop.fieldInversion = 0;
   }
   else if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 3)
   {
      //->21c4f994
      isrDataPtr->frameCrop.frameField = 0;
      isrDataPtr->frameCrop.fieldInversion = 0;
   }
   else if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 4)
   {
      //->21c4fa64
      isrDataPtr->frameCrop.frameField = 0;
      isrDataPtr->frameCrop.fieldInversion = 0;
   }
   else if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 5)
   {
      //->21c4fa48
      isrDataPtr->frameCrop.frameField = 0;
      isrDataPtr->frameCrop.fieldInversion = 1;
   }
   else if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 6)
   {
      //->21c4fae4
      isrDataPtr->frameCrop.frameField = 1;
      isrDataPtr->frameCrop.fieldInversion = 0;
   }
   else if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 8)
   {
      //->21c50000
      isrDataPtr->frameCrop.frameField = 0;
      isrDataPtr->frameCrop.fieldInversion = 0;
   }
   else if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 9)
   {
      //->21c4fa48
      isrDataPtr->frameCrop.frameField = 0;
      isrDataPtr->frameCrop.fieldInversion = 1;
   }
   else if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 10)
   {
      //->21c4fae4
      isrDataPtr->frameCrop.frameField = 1;
      isrDataPtr->frameCrop.fieldInversion = 0;
   }
   else if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo == 11)
   {
      //->21c4fae4
      isrDataPtr->frameCrop.frameField = 1;
      isrDataPtr->frameCrop.fieldInversion = 0;
   }
   else
   {
      //21c4f1e0
      isrDataPtr->frameCrop.frameField = 0;
      isrDataPtr->frameCrop.fieldInversion = 0;
   }
   //21c4f1f4
   if ((isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].topDecError != 0) ||
         (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].botDecError != 0))
   {
      //->21c4f578
      isrDataPtr->frameDecError = //705400
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].topDecError |
         isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].botDecError;

      isrDataPtr->frameCrop.aspectRatio = //705308
            isrDataPtr->lkgFrameCrop.aspectRatio; //705112
      isrDataPtr->frameCrop.frameField = //705320
            isrDataPtr->lkgFrameCrop.frameField; //705124
      isrDataPtr->frameCrop.fieldInversion = //705324
            isrDataPtr->lkgFrameCrop.fieldInversion; //705128
      isrDataPtr->frameCrop.x0 = //705328
            isrDataPtr->lkgFrameCrop.x0; //705132
      isrDataPtr->frameCrop.y0 = //705332
            isrDataPtr->lkgFrameCrop.y0; //705136
      isrDataPtr->frameCrop.displayWidth = //705336
            isrDataPtr->lkgFrameCrop.displayWidth; //705140
      isrDataPtr->frameCrop.displayHeight = //705340
            isrDataPtr->lkgFrameCrop.displayHeight; //705144
      isrDataPtr->frameCrop.decodedWidth = //705344
            isrDataPtr->lkgFrameCrop.decodedWidth; //705148
      isrDataPtr->frameCrop.decodedHeight = //705348
            isrDataPtr->lkgFrameCrop.decodedHeight; //705152
      isrDataPtr->frameCrop.topFieldSerialNo = //705352
            isrDataPtr->lkgFrameCrop.topFieldSerialNo; //705156
      isrDataPtr->frameCrop.botFieldSerialNo = //705356
            isrDataPtr->lkgFrameCrop.botFieldSerialNo; //705160
      isrDataPtr->frameCrop.currAfd = //705360
            isrDataPtr->lkgFrameCrop.currAfd; //705164
      isrDataPtr->frameCrop.mpegIFrameState = //705372
            isrDataPtr->lkgFrameCrop.mpegIFrameState; //705176

      isrDataPtr->frameCrop.frameIdx = //705376
            isrDataPtr->frameIdx; //705396
   }
   else
   {
      //21c4f230
      isrDataPtr->frameDecError = 0;

      isrDataPtr->lkgFrameCrop.aspectRatio = //705112
            isrDataPtr->frameCrop.aspectRatio; //705308
      isrDataPtr->lkgFrameCrop.frameField = //705124
            isrDataPtr->frameCrop.frameField; //705320
      isrDataPtr->lkgFrameCrop.fieldInversion = //705128
            isrDataPtr->frameCrop.fieldInversion; //705324
      isrDataPtr->lkgFrameCrop.x0 = //705132
            isrDataPtr->frameCrop.x0; //705328
      isrDataPtr->lkgFrameCrop.y0 = //705136
            isrDataPtr->frameCrop.y0; //705332
      isrDataPtr->lkgFrameCrop.displayWidth = //705140
            isrDataPtr->frameCrop.displayWidth; //705336
      isrDataPtr->lkgFrameCrop.displayHeight = //705144
            isrDataPtr->frameCrop.displayHeight; //705340
      isrDataPtr->lkgFrameCrop.decodedWidth = //705148
            isrDataPtr->frameCrop.decodedWidth; //705344
      isrDataPtr->lkgFrameCrop.decodedHeight = //705152
            isrDataPtr->frameCrop.decodedHeight; //705348
      isrDataPtr->lkgFrameCrop.topFieldSerialNo = //705156
            isrDataPtr->frameCrop.topFieldSerialNo; //705352
      isrDataPtr->lkgFrameCrop.botFieldSerialNo = //705160
            isrDataPtr->frameCrop.botFieldSerialNo; //705356
      isrDataPtr->lkgFrameCrop.currAfd = //705164
            isrDataPtr->frameCrop.currAfd; //705360
      isrDataPtr->lkgFrameCrop.mpegIFrameState = //705176
            isrDataPtr->frameCrop.mpegIFrameState; //705372

      isrDataPtr->frameCrop.frameIdx = //705376
            isrDataPtr->frameIdx; //705396
   }
   //21c4f340
   isrDataPtr->frameCrop.x0 = 0; //705328
   isrDataPtr->frameCrop.y0 = 0; //705332
   isrDataPtr->frameCrop.displayWidth = //705336
         isrDataPtr->frameCrop.decodedWidth; //705344
   isrDataPtr->frameCrop.displayHeight = //705340
         isrDataPtr->frameCrop.decodedHeight; //705348

   isrDataPtr->pctInfo.nextFrameInfo.aspectRatio = //705228
         isrDataPtr->frameCrop.aspectRatio; //705308
   isrDataPtr->pctInfo.nextFrameInfo.frameField = //705232
         isrDataPtr->frameCrop.frameField; //705320
   isrDataPtr->pctInfo.nextFrameInfo.fieldInversion = //705236
         isrDataPtr->frameCrop.fieldInversion; //705324
   isrDataPtr->pctInfo.nextFrameInfo.decodedWidth = //705240
         isrDataPtr->frameCrop.decodedWidth; //705344
   isrDataPtr->pctInfo.nextFrameInfo.decodedHeight = //705244
         isrDataPtr->frameCrop.decodedHeight; //705348

   if ((isrDataPtr->pctInfo.lastFrameInfo.aspectRatio != isrDataPtr->pctInfo.nextFrameInfo.aspectRatio) ||
         (isrDataPtr->pctInfo.lastFrameInfo.frameField != isrDataPtr->pctInfo.nextFrameInfo.frameField) ||
         (isrDataPtr->pctInfo.lastFrameInfo.fieldInversion != isrDataPtr->pctInfo.nextFrameInfo.fieldInversion) ||
         (isrDataPtr->pctInfo.lastFrameInfo.decodedWidth != isrDataPtr->pctInfo.nextFrameInfo.decodedWidth) ||
         (isrDataPtr->pctInfo.lastFrameInfo.decodedHeight != isrDataPtr->pctInfo.nextFrameInfo.decodedHeight))
   {
      //21c4f3c4
      isrDataPtr->pctInfo.paramChangeTrigger = 1;

      if (isrDataPtr->paramChangeCbk != NULL)
      {
         (isrDataPtr->paramChangeCbk)(
               &isrDataPtr->pctInfo.nextFrameInfo,
               &isrDataPtr->pctInfo.lastFrameInfo,
               isrDataPtr->paramChangeOptData);

         isrDataPtr->pctInfo.paramChangeTrigger = 0;
      }
   }
   //21c4f404
   isrDataPtr->pctInfo.lastFrameInfo.aspectRatio =
      isrDataPtr->pctInfo.nextFrameInfo.aspectRatio;
   isrDataPtr->pctInfo.lastFrameInfo.frameField =
      isrDataPtr->pctInfo.nextFrameInfo.frameField;
   isrDataPtr->pctInfo.lastFrameInfo.fieldInversion =
      isrDataPtr->pctInfo.nextFrameInfo.fieldInversion;
   isrDataPtr->pctInfo.lastFrameInfo.decodedWidth =
      isrDataPtr->pctInfo.nextFrameInfo.decodedWidth;
   isrDataPtr->pctInfo.lastFrameInfo.decodedHeight =
      isrDataPtr->pctInfo.nextFrameInfo.decodedHeight;
}


/* 21c4eb88 - todo */
uint32_t FAPI_VIDEC_IsrDisplay0(void)
{
   FAPI_VIDEC_VideoDecoderIsrDataT* isrDataPtr;
   uint32_t r9 = 0;
   
   FAPI_SYS_PRINT_DEBUG(5, "FAPI_VIDEC_IsrDisplay0\n");
   
   FREG_VO_SetDispirqctrl_Dispirq0(0);
   
   if (Data_21f67278 == 0)
   {
      //->21c4eda0
      return r9;
   }

   isrDataPtr = Data_21f67278->isrDataPtr;
   
   if ((isrDataPtr == 0) || (isrDataPtr->inUse == 0))
   {
      //->21c4eda0
      return r9;
   }
   //21c4ebc0
   if ((isrDataPtr->startStopState != FAPI_VIDEC_REQUEST_TO_STOP) &&
         (0 != func_21c2f890()))
   {
      r9 = (uint32_t) Data_21f67278;
   }
   //21c4ebe0
   isrDataPtr->currIsrTimeUsec = FAPI_TIMER_GetTimeStamp(1);
   
   isrDataPtr->isrCurrField = FREG_VO_GetDisppicpos_Currentfield();
   isrDataPtr->isrNextField = 1 - isrDataPtr->isrCurrField;
   
   if (isrDataPtr->enableDisableState == FAPI_VIDEC_REQUEST_TO_FORCE_ENABLE)
   {
      //->21c4eda8
      if (isrDataPtr->isrCurrField == 1)
      {
         FREG_VO_SetVolayerenable_Layerenable(1);
         
         isrDataPtr->enableDisableState = FAPI_VIDEC_FORCE_ENABLED;
      }
      //21c4ec10
   }
   else if (isrDataPtr->enableDisableState == FAPI_VIDEC_REQUEST_TO_FORCE_DISABLE)
   {
      //->21c4edc0
      if (isrDataPtr->isrCurrField == 1)
      {
         FREG_VO_SetVolayerenable_Layerenable(0);
         
         isrDataPtr->enableDisableState = FAPI_VIDEC_FORCE_DISABLED;
      }
      //21c4ec10
   }
   //21c4ec10
   if ((isrDataPtr->bootState == FAPI_VIDEC_BOOTED) &&
      (isrDataPtr->resetState == FAPI_VIDEC_NOT_RESET) &&
         ((isrDataPtr->startStopState == FAPI_VIDEC_STARTED) ||
         (isrDataPtr->startStopState == FAPI_VIDEC_REQUEST_TO_STOP) ||
         (isrDataPtr->mpegIFrameState != FAPI_VIDEC_NON_MPEG_IFRAME_STATE)))
   {
      //21c4ec44
      fapi_videc_set_aud_info_fill_level(isrDataPtr);
      fapi_videc_set_frame_info_fill_level(isrDataPtr);
      
      if (FAPI_VIDEC_ERR_VES_BUFFER_OVERFLOW == 
         fapi_videc_update_buffer_info(isrDataPtr))
      {
         //->21c4ee24
         if (isrDataPtr->vesOverflowCbk != 0)
         {
            (isrDataPtr->vesOverflowCbk)(isrDataPtr->vesOverflowOptData);
         }
      }
      //21c4ec68
      FAPI_SYS_PRINT_DEBUG(6, "isrDataPtr->frameStartDisplay=%d\n",
            isrDataPtr->frameStartDisplay);
      
      if (isrDataPtr->frameStartDisplay == 0) //r1
      {
         FAPI_SYS_PRINT_DEBUG(6, "isrDataPtr->pmcrInfo.targetPlaybackMode=%d\n",
               isrDataPtr->pmcrInfo.targetPlaybackMode);
         
         //->21c4eddc
         if (isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_NORMAL_PLAYBACK_MODE/*1*/) //r0
         {
            //->21c4f550
            if (isrDataPtr->mpegIFrameState == FAPI_VIDEC_NON_MPEG_IFRAME_STATE) //0)
            {
               //21c4f55c
               if (isrDataPtr->frameInfo.fillLevel > 0)
               {
                  //21c4f56c
                  //r9 = 0; //r1
                  isrDataPtr->frameStartDisplay = 1;
                  //->21c4ed94
                  return 0; //r9;
               }
               //21c4ec80
            }
            else
            {
               //21c4f6a0
               if (isrDataPtr->frameInfo.fillLevel >= 0)
               {
                  //21c4f56c
                  //r9 = 0; //r1
                  isrDataPtr->frameStartDisplay = 1;
                  //->21c4ed94
                  return 0; //r9;
               }
               //21c4ec80
            }
         } //if (isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_NORMAL_PLAYBACK_MODE)
         //21c4edec
         else if (isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_FIRST_I_ONLY_PLAYBACK_MODE) //2
         {
            //->21c4ee44
            if (isrDataPtr->frameInfo.fillLevel >= 0)
            {
               isrDataPtr->frameStartDisplay = 1;
               //21c4ee5c
            }
            //21c4ec80
         } //else if (isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_FIRST_I_ONLY_PLAYBACK_MODE)
         //21c4edf4
         else if (isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_I_ONLY_PLAYBACK_MODE) //3
         {
            //->21c4f6b4
            if (isrDataPtr->mpegIFrameState == FAPI_VIDEC_NON_MPEG_IFRAME_STATE)
            {
               //->21c4edfc
               if (isrDataPtr->frameInfo.fillLevel > 0)
               {
                  //21c4ee0c
                  //r9 = 0;
                  isrDataPtr->frameStartDisplay = 1;
                  //->21c4ed94
                  return 0; //r9;
               }
               //21c4ec80
            }
            else
            {
               //21c4f6c0
               if (isrDataPtr->frameInfo.fillLevel >= 0)
               {
                  //->21c4ee0c
                  //r9 = 0;
                  isrDataPtr->frameStartDisplay = 1;
                  //->21c4ed94
                  return 0; //r9;
               }
               //21c4ec80
            }
         } //else if (isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_I_ONLY_PLAYBACK_MODE)
         else
         {
            //21c4edfc
            if (isrDataPtr->frameInfo.fillLevel > 0)
            {
               //21c4ee0c
               //r9 = 0;
               isrDataPtr->frameStartDisplay = 1;
               //->21c4ed94
               return 0; //r9;
            }
            //21c4ec80
         }
      } //if (isrDataPtr->frameStartDisplay == 0) //r1
      //21c4ec78
      /*else*/ if (isrDataPtr->frameStartDisplay == 1)
      {
         //->21c4ee5c
         FAPI_SYS_PRINT_DEBUG(6, "isrDataPtr->frameDisplayOrderInfo=%d\n",
               isrDataPtr->frameDisplayOrderInfo/*705380*/);

         if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 2)
         {
            //21c4f6d4
            if (isrDataPtr->decoderPlaybackMode == 0)
            {
               //21c4eeac
            }
            else if ((isrDataPtr->decoderPlaybackMode == 1) ||
                  (isrDataPtr->decoderPlaybackMode == 2) ||
                  (isrDataPtr->decoderPlaybackMode == 3) ||
                  (isrDataPtr->decoderPlaybackMode == 4))
            {
               //21c4f6ec
               if (isrDataPtr->frameState == 10)
               {
                  isrDataPtr->frameState = 9;
                  //->21c4f70c
                  func_21c4e204(isrDataPtr);
                  //21c4eeac
               }
               else if (isrDataPtr->frameState == 9)
               {
                  //21c4f70c
                  func_21c4e204(isrDataPtr);
                  //21c4eeac
               }
               //21c4eeac
            }
            else
            {
               //21c4fab8
               if (isrDataPtr->frameState == 2)
               {
                  //21c4eeac
               }
               else 
               {
                  //21c4fac8
                  isrDataPtr->frameState--;
                  
                  if (isrDataPtr->frameState == 9)
                  {
                     func_21c4e204(isrDataPtr);
                  }
                  //21c4eeac
               }
            }
         } //if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 2)
         else if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 3)
         {
            //21c4f740
         }
         else if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 4)
         {
            //21c4f8d0
         }
         else if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 5)
         {
            //21c4f95c
         }
         else if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 6)
         {
            //21c4f9f4
            if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_PLAYBACK_PAUSE) //0)
            {
               //21c4eeac
            }
            else if ((isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_NORMAL_PLAYBACK_MODE/*1*/) ||
                  (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_FIRST_I_ONLY_PLAYBACK_MODE/*2*/) ||
                  (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_I_ONLY_PLAYBACK_MODE/*3*/) ||
                  (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_I_AND_P_ONLY_PLAYBACK_MODE/*4*/))
            {
               //21c4fa0c
               if (isrDataPtr->frameState == FAPI_VIDEC_FRAME_DISPLAY_FRAME_2_VSYNC) //11)
               {
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_1_VSYNC; //10;
                  //21c4eeac
               }
               if (isrDataPtr->frameState == FAPI_VIDEC_FRAME_DISPLAY_FRAME_1_VSYNC) //10)
               {
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_0_VSYNC; //9;
                  //->21c4fa3c
                  func_21c4e204(isrDataPtr);
                  //21c4eeac
               }
               else if (isrDataPtr->frameState == FAPI_VIDEC_FRAME_DISPLAY_FRAME_0_VSYNC) //9)
               {
                  //21c4fa3c
                  func_21c4e204(isrDataPtr);
                  //21c4eeac
               }
               //21c4eeac
            }
            else
            {
               //21c5010c
               if (isrDataPtr->frameState == FAPI_VIDEC_FRAME_DISPLAY_START) //2)
               {
                  //21c4eeac
               }
               else 
               {
                  //21c5011c
                  isrDataPtr->frameState--;
                  
                  if (isrDataPtr->frameState == FAPI_VIDEC_FRAME_DISPLAY_FRAME_0_VSYNC) //9)
                  {
                     //21c5012c
                     func_21c4e204(isrDataPtr);
                  }
                  //21c4eeac
               }
            }
         }
         else if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 8)
         {
            //21c4fc48
         }
         else if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 9)
         {
            //21c4febc
         }
         else if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 10)
         {
            //21c4ff48
         }
         else if (isrDataPtr->frameDisplayOrderInfo/*705380*/ == 11)
         {
            //21c50138
         }
         //21c4eeac / 21929c14
         FAPI_SYS_PRINT_DEBUG(6, "isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].state=%d\n",
               isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].state);

         if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].state //698796
               == FAPI_VIDEC_FRAME_DECODED)
         {
            //21c4eed4
            if (isrDataPtr->videoDecInfoCbk != 0)
            {
               //21c4eee8
               isrDataPtr->videoDecInfoData.rPtr = isrDataPtr->frameInfo.rPtr;
               isrDataPtr->videoDecInfoData.serialNum =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].serialNum;
               isrDataPtr->videoDecInfoData.frameBank =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayFrameBank;
               isrDataPtr->videoDecInfoData.displayWidth =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayWidth;
               isrDataPtr->videoDecInfoData.displayHeight =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayHeight;
               isrDataPtr->videoDecInfoData.decodedWidth =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedWidth;
               isrDataPtr->videoDecInfoData.decodedHeight =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].decodedHeight;
               isrDataPtr->videoDecInfoData.displayOrderInfo =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].displayOrderInfo;
               isrDataPtr->videoDecInfoData.topFieldSerialNo =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].topFieldSerialNo;
               isrDataPtr->videoDecInfoData.botFieldSerialNo =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].botFieldSerialNo;
               isrDataPtr->videoDecInfoData.ptsValidFlag =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].ptsValidFlag;
               isrDataPtr->videoDecInfoData.dtsValidFlag =
                  isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].dtsValidFlag;
               long long bla = isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].pts;
               isrDataPtr->videoDecInfoData.pts = bla+bla;
               bla = isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].dts;
               isrDataPtr->videoDecInfoData.dts = bla+bla;

               (isrDataPtr->videoDecInfoCbk)(&isrDataPtr->videoDecInfoData,
                     isrDataPtr->videoOptData);
            } //if (isrDataPtr->videoDecInfoCbk != 0)
            //21c4eff8            
            func_21927d84(isrDataPtr);
            
            isrDataPtr->frameState = //705300
               FAPI_VIDEC_FRAME_DISPLAY_START;
            isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].state = //698796
               FAPI_VIDEC_FRAME_DISPLAY_START;
         } //if (isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].state == FAPI_VIDEC_FRAME_DECODED)
         //21c4f480
         if (isrDataPtr->frameState == FAPI_VIDEC_FRAME_DISPLAY_START)
         {
            //21c4f490
            FAPI_SYS_PRINT_DEBUG(4, "21c4f490: isrDataPtr->pecrInfo.playbackEnvironmentChangeReqState=%d\n",
                  isrDataPtr->pecrInfo.playbackEnvironmentChangeReqState);

            if (isrDataPtr->pecrInfo.playbackEnvironmentChangeReqState == 1) //705184 == 1)
            {
               //->21c4f9cc
               isrDataPtr->decoderPlaybackEnvironment = //152
                  isrDataPtr->pecrInfo.currPlaybackEnvironment =
                     isrDataPtr->pecrInfo.targetPlaybackEnvironment; //705192

               if (isrDataPtr->decoderPlaybackEnvironment == FAPI_VIDEC_PVR_PLAYBACK_ENVIRONMENT) //1)
               {
                  //->21c500a8
                  isrDataPtr->pvrInfo.pts = 0; //705216
                  isrDataPtr->pvrInfo.setPtsToStc = 0; //705208
               }
               //21c4f9e8
               isrDataPtr->pecrInfo.playbackEnvironmentChangeReqState = 0;
               //21c4f4a0
            }
            //21c4f4a0
            FAPI_SYS_PRINT_DEBUG(4, "21c4f4a0: isrDataPtr->pmcrInfo.playbackModeChangeReqState=%d\n",
                  isrDataPtr->pmcrInfo.playbackModeChangeReqState);

            if (isrDataPtr->pmcrInfo.playbackModeChangeReqState == 1) //705196 == 1)
            {
               //->21c4f9ac
               isrDataPtr->decoderPlaybackMode = //156
                  isrDataPtr->pmcrInfo.currPlaybackMode =
                     isrDataPtr->pmcrInfo.targetPlaybackMode; //705204
               
               isrDataPtr->pmcrInfo.playbackModeChangeReqState = 0;
            }
            //21c4f4b0
            FAPI_SYS_PRINT_DEBUG(4, "21c4f4b0: isrDataPtr->frameDisplayOrderInfo=%d\n",
                  isrDataPtr->frameDisplayOrderInfo);

            if (isrDataPtr->frameDisplayOrderInfo == 2)
            {
               //->21c4fd78
               FREG_VO_SetFramoffset_Frameoffset(isrDataPtr->frameBank);
               FREG_VO_SetVomode_Vofieldmode(1);
               FREG_VO_SetVomode_Voprogr(1);
               FREG_VO_SetVomode_Vofield(0);
               
               if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_PLAYBACK_PAUSE) //0)
               {
                  //->21c4fef4
                  //r2 = 10;
                  //->21c4fdec
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_1_VSYNC; //10;
                  isrDataPtr->frameFieldState = FAPI_VIDEC_TOP_FIELD_FREEZE_STATE; //1;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_NORMAL_PLAYBACK_MODE) //1)
               {
                  //->21c505c4
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_1_VSYNC; //10;
                  isrDataPtr->frameFieldState = FAPI_VIDEC_TOP_FIELD_FREEZE_STATE; //1;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_FIRST_I_ONLY_PLAYBACK_MODE) //2)
               {
                  //->21c4fef4
                  //r2 = 10;
                  //->21c4fdec
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_1_VSYNC; //10;
                  isrDataPtr->frameFieldState = FAPI_VIDEC_TOP_FIELD_FREEZE_STATE; //1;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_I_ONLY_PLAYBACK_MODE) //3)
               {
                  //->21c4fef4
                  //r2 = 10;
                  //->21c4fdec
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_1_VSYNC; //10;
                  isrDataPtr->frameFieldState = FAPI_VIDEC_TOP_FIELD_FREEZE_STATE; //1;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_I_AND_P_ONLY_PLAYBACK_MODE) //4)
               {
                  //->21c4fef4
                  //r2 = 10;
                  //->21c4fdec
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_1_VSYNC; //10;
                  isrDataPtr->frameFieldState = FAPI_VIDEC_TOP_FIELD_FREEZE_STATE; //1;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_2X_PLAYBACK_MODE) //5)
               {
                  //21c4fdcc
                  //r2 = 11;
                  //->21c4fdec
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_2_VSYNC; //11;
                  isrDataPtr->frameFieldState = FAPI_VIDEC_TOP_FIELD_FREEZE_STATE; //1;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_4X_PLAYBACK_MODE) //6)
               {
                  //21c4fdd8
                  //r2 = 13;
                  //->21c4fdec
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_4_VSYNC; //13;
                  isrDataPtr->frameFieldState = FAPI_VIDEC_TOP_FIELD_FREEZE_STATE; //1;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_8X_PLAYBACK_MODE) //7)
               {
                  //21c4fde8
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_8_VSYNC; //17;
                  isrDataPtr->frameFieldState = FAPI_VIDEC_TOP_FIELD_FREEZE_STATE; //1;
                  //->21c4f814
               }
               //->21c4f814
               isrDataPtr->invokeAutoScalers = 1; //705408
            } //if (isrDataPtr->frameDisplayOrderInfo == 2)
            else if (isrDataPtr->frameDisplayOrderInfo == 3)
            {
               //->21c4fe04
            }
            else if (isrDataPtr->frameDisplayOrderInfo == 4)
            {
               //->21c4f784
            }
            else if (isrDataPtr->frameDisplayOrderInfo == 5)
            {
               //->21c4fce8
            }
            else if (isrDataPtr->frameDisplayOrderInfo == 6)
            {
               //->21c4fefc
               FAPI_SYS_PRINT_DEBUG(4, "21c4fefc: isrDataPtr->decoderPlaybackMode=%d\n",
                     isrDataPtr->decoderPlaybackMode);

               if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_PLAYBACK_PAUSE) //0)
               {
                  //21c4ff08
                  if (isrDataPtr->frameCrop.decodedHeight >= 1024)
                  {
                     //21c4ff18
                     isrDataPtr->frameCrop.frameField = 0; //705320
                     
                     FREG_VO_SetVomode_Vofieldmode(1);
                     FREG_VO_SetVomode_Voprogr(1);
                     FREG_VO_SetVomode_Vofield(0);
                  }
                  else
                  {
                     //21c50504
                     isrDataPtr->frameCrop.frameField = 1; //705320
                     
                     FREG_VO_SetVomode_Vofieldmode(1);
                     FREG_VO_SetVomode_Voprogr(0);
                     FREG_VO_SetVomode_Vofield(0);
                     //->21c4ff38
                  }
                  //21c4ff38
                  FREG_VO_SetFramoffset_Frameoffset(isrDataPtr->frameBank);
                  //->21c4f814
               }
               //21c50318
               else if ((isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_NORMAL_PLAYBACK_MODE/*1*/) ||
                     (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_FIRST_I_ONLY_PLAYBACK_MODE/*2*/) ||
                     (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_I_ONLY_PLAYBACK_MODE/*3*/) ||
                     (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_I_AND_P_ONLY_PLAYBACK_MODE/*4*/))
               {
                  //21c50324
                  FAPI_SYS_PRINT_DEBUG(4, "isrDataPtr->vesInfo.vesFrameRate=%d\n",
                        isrDataPtr->vesInfo.vesFrameRate);

                  if (isrDataPtr->vesInfo.vesFrameRate == 2397)
                  {
                     //->21c509d8
                  }
                  else if (isrDataPtr->vesInfo.vesFrameRate == 2400)
                  {
                     //->21c509d8
                  }
                  else if (isrDataPtr->vesInfo.vesFrameRate == 2500)
                  {
                     //->21c50c54
                  }
                  else if (isrDataPtr->vesInfo.vesFrameRate == 2997)
                  {
                     //->21c50ac0
                  }
                  else if (isrDataPtr->vesInfo.vesFrameRate == 3000)
                  {
                     //->21c50c54
                  }
                  else if (isrDataPtr->vesInfo.vesFrameRate == 5000)
                  {
                     //->21c50970
                  }
                  else if (isrDataPtr->vesInfo.vesFrameRate == 5994)
                  {
                     //->21c50970
                  }
                  else if (isrDataPtr->vesInfo.vesFrameRate == 6000)
                  {
                     //->21c50970
                  }
                  else
                  {
                     //21c50384
                     if (isrDataPtr->isrCurrField == 1)
                     {
                        //21c50390
                        FREG_VO_SetFramoffset_Frameoffset(isrDataPtr->frameBank);
                     
                        isrDataPtr->frameCrop.frameField = 0; //r4
                        
                        FREG_VO_SetVomode_Vofieldmode(1);
                        FREG_VO_SetVomode_Voprogr(1);
                        FREG_VO_SetVomode_Vofield(0);
                        
                        isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_2_VSYNC; //11;
                     }
                     //->21c4f814
                  }
               }
               //21c50440
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_2X_PLAYBACK_MODE) //5)
               {
                  //->21c50e90
                  //TODO
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_4X_PLAYBACK_MODE) //6)
               {
                  //->21c50d5c
                  //TODO
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_8X_PLAYBACK_MODE) //7)
               {
                  //->21c50458
                  //TODO
               }
               //->21c4f814
               isrDataPtr->invokeAutoScalers = 1; //705408
            } //else if (isrDataPtr->frameDisplayOrderInfo == 6)
            else if (isrDataPtr->frameDisplayOrderInfo == 8)
            {
               //->21c50054
            }
            else if (isrDataPtr->frameDisplayOrderInfo == 9)
            {
               //->21c50204
            }
            else if (isrDataPtr->frameDisplayOrderInfo == 10)
            {
               //->21c50664
            }
            else if (isrDataPtr->frameDisplayOrderInfo == 11)
            {
               //->21c50714
               FREG_VO_SetFramoffset_Frameoffset(isrDataPtr->frameBank);
               FREG_VO_SetVomode_Vofieldmode(1);
               FREG_VO_SetVomode_Voprogr(0);
               FREG_VO_SetVomode_Vofield(0);
               
               if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_PLAYBACK_PAUSE) //0)
               {
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_NORMAL_PLAYBACK_MODE) //1)
               {
                  //->21c50c44
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_3_VSYNC; //12;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_FIRST_I_ONLY_PLAYBACK_MODE) //2)
               {
                  //->21c50c44
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_3_VSYNC; //12;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_I_ONLY_PLAYBACK_MODE) //3)
               {
                  //->21c50c44
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_3_VSYNC; //12;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_I_AND_P_ONLY_PLAYBACK_MODE) //4)
               {
                  //->21c50c44
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_3_VSYNC; //12;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_2X_PLAYBACK_MODE) //5)
               {
                  //21c50768
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_6_VSYNC; //15;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_4X_PLAYBACK_MODE) //6)
               {
                  //21c5077c
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_12_VSYNC; //21;
                  //->21c4f814
               }
               else if (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_8X_PLAYBACK_MODE) //7)
               {
                  //21c50790
                  isrDataPtr->frameState = FAPI_VIDEC_FRAME_DISPLAY_FRAME_24_VSYNC; //33;
                  //->21c4f814
               }
               //->21c4f814
               isrDataPtr->invokeAutoScalers = 1; //705408
            } //else if (isrDataPtr->frameDisplayOrderInfo == 11)
            //21c4f500
            if (isrDataPtr->invokeAutoScalers == 1) //705408
            {
               //->21c4f820
               isrDataPtr->invokeAutoScalers = 0; //705408
               
               if ((isrDataPtr->hdAutoScaleCbk != 0) &&
                     (isrDataPtr->hdScalerHandle != 0))
               {
                  //21c4f84c
                  (isrDataPtr->hdAutoScaleCbk)(&isrDataPtr->frameCrop,
                        isrDataPtr->hdScalerHandle, 0);
               }
               //21c4f858
               if ((isrDataPtr->sdAutoScaleCbk != 0) &&
                     (isrDataPtr->sdScalerHandle != 0))
               {
                  //2192b7a4
                  (isrDataPtr->sdAutoScaleCbk)(&isrDataPtr->frameCrop,
                        isrDataPtr->sdScalerHandle, 0);
               }
               //21c4f510
            }
            //21c4f510
            if (isrDataPtr->enableDisableState == FAPI_VIDEC_REQUEST_TO_SYNCHRONIZE_ENABLE) //0)
            {
               //->21c4f920
               FREG_VO_SetVolayerenable_Layerenable(1);
               
               isrDataPtr->enableDisableState = FAPI_VIDEC_SYNCHRONIZE_ENABLED; //2
               //21c4f930
            }
            if (isrDataPtr->enableDisableState == FAPI_VIDEC_SYNCHRONIZE_ENABLED) //2)
            {
               //->21c4f930
               if (isrDataPtr->frameAvailableCbk != NULL)
               {
                  (isrDataPtr->frameAvailableCbk)(isrDataPtr->frameAvailableOptData);
                  
                  isrDataPtr->frameAvailableCbk = NULL;
                  isrDataPtr->frameAvailableOptData = NULL;
               }
            }
            //21c4f524
            isrDataPtr->frameInfo.decodedPic[isrDataPtr->frameInfo.rPtr].state =
               isrDataPtr->frameState;
            //->21c4ec80                        
         } //if (isrDataPtr->frameState == FAPI_VIDEC_FRAME_DISPLAY_START)
         //21c4ec80
      } //if (isrDataPtr->frameStartDisplay == 1)
      //21c4ec80
      if ((isrDataPtr->decoderPlaybackEnvironment == FAPI_VIDEC_LIVE_PLAYBACK_ENVIRONMENT) &&
            (isrDataPtr->mpegIFrameState == FAPI_VIDEC_NON_MPEG_IFRAME_STATE) &&
            (isrDataPtr->decoderPlaybackMode == FAPI_VIDEC_NORMAL_PLAYBACK_MODE))
      {
         //21c4eca4
         isrDataPtr->Data_44 = FAPI_TIMER_GetTimeStamp(1000) -
            isrDataPtr->Data_12;
         
         isrDataPtr->Data_52 = FAPI_TIMER_GetTimeStamp(1000) -
            isrDataPtr->currVcpbDecTimeMsec;
         
         isrDataPtr->Data_60 = FAPI_TIMER_GetTimeStamp(1000) -
            isrDataPtr->Data_28;
         
         if (isrDataPtr->Data_44 < 2000)
         {
            //21c4ed38
            isrDataPtr->Data_200 = 1;
         }
         else
         {
            //21c4ee1c
            isrDataPtr->Data_200 = 0;
         }
         //21c4ed40
         if (isrDataPtr->Data_44 >= 3000)
         {
            //21c4ed5c
            isrDataPtr->healthState = FAPI_VIDEC_DEAD;
         }
         //->21c4fb00
         else if (isrDataPtr->Data_52 >= 3000)
         {
            //21c4fb0c
            isrDataPtr->healthState = FAPI_VIDEC_BAD_HEALTH_L2;
         }
         //21c4ffd4
         else if (isrDataPtr->Data_60 >= 3000)
         {
            //21c4fff4
            isrDataPtr->healthState = FAPI_VIDEC_BAD_HEALTH_L1;
         }
         //21c50288
         else if (isrDataPtr->frameDecError != 0) //705400
         {
            isrDataPtr->healthState = FAPI_VIDEC_BAD_HEALTH_L0;
         }
         else
         {
            isrDataPtr->healthState = FAPI_VIDEC_GOOD_HEALTH;
         }
         //21c4ed64
      }
      //21c4ed64
   }
   //21c4ed64
   isrDataPtr->isrSerialIdx++;
   
   isrDataPtr->Data_36 = FAPI_TIMER_GetTimeStamp(1) -
      isrDataPtr->currIsrTimeUsec;
   
   return r9;
}


/* 21c4d380 - todo */
void func_21c4d380(void)
{
   FAPI_SYS_PRINT_MSG("func_21c4d380\n");
}


/* 21c4e1a4 - complete */
void FAPI_VIDEC_BsrDisplay0(uint32_t a)
{
//   FAPI_SYS_PRINT_MSG("FAPI_VIDEC_BsrDisplay0\n");
   
   FAPI_VIDEC_VideoDecoderHandleT* h = (void*) a;
   
   if (h != 0)
   {
      videc_lock();
      
      if (checkHandle(h) && 
            (h->isrDataPtr != 0) &&
            (h->isrDataPtr->startStopState == FAPI_VIDEC_STARTED))
      {
         if ((h->isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_2X_PLAYBACK_MODE) ||
               (h->isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_4X_PLAYBACK_MODE) ||
               (h->isrDataPtr->pmcrInfo.targetPlaybackMode == FAPI_VIDEC_SLOW_FORWARD_8X_PLAYBACK_MODE))
         {
            func_21c4d380();
         }
      }
      
      videc_unlock();
   }
}


struct Struct_1280 
{
   uint32_t Data_0; //0
   uint32_t Data_4; //4
   uint32_t Data_8; //8
   uint32_t Data_12; //12
   uint32_t Data_16; //16
   uint32_t Data_20; //20
   uint32_t Data_24; //24
   uint32_t Data_0x1c; //28
   uint32_t Data_0x20; //32
   uint32_t Data_0x24; //36
   uint32_t Data_0x28; //40
   uint32_t Data_0x2c; //44
   uint32_t Data_0x30; //48
   uint32_t Data_0x34; //52
   uint32_t Data_0x38; //56
   uint32_t Data_0x3c; //60
   uint32_t Data_0x40; //64
   uint32_t Data_0x44; //68
   uint32_t Data_0x48; //72
   uint32_t Data_0x4c; //76
   uint32_t Data_0x50; //80
   uint32_t Data_0x54; //84
   uint32_t Data_0x58; //88
   uint32_t Data_0x5c; //92
   uint32_t Data_0x60; //96
   uint32_t Data_0x64; //100
   uint32_t Data_0x68; //104
   uint32_t Data_0x6c; //108
   uint32_t Data_0x70; //112
   uint32_t Data_0x74; //116
   uint32_t Data_0x78; //120
   uint32_t Data_0x7c; //124
   uint32_t Data_0x80; //128
   uint32_t Data_0x84; //132
   uint32_t Data_0x88; //136
   uint32_t Data_0x8c; //140
   uint32_t Data_0x90; //144
   uint32_t Data_0x94; //148
   uint32_t Data_0x98; //152
   uint32_t Data_0x9c; //156
   uint32_t Data_0xa0; //160
   uint32_t Data_0xa4; //164
   uint32_t Data_0xa8; //168
   uint32_t Data_0xac; //172
   uint32_t Data_0xb0; //176
   uint32_t Data_0xb4; //180
   uint32_t Data_0xb8; //184
   uint32_t Data_0xbc; //188
   uint32_t Data_0xc0; //192
   uint32_t Data_0xc4; //196
   uint32_t Data_0xc8; //200
   uint32_t Data_0xcc; //204
   uint32_t Data_0xd0; //208
   uint32_t Data_0xd4; //212
   uint32_t Data_0xd8; //216
   uint32_t Data_0xdc; //220
   uint32_t Data_0xe0; //224
   uint32_t Data_0xe4; //228
   uint32_t Data_0xe8; //232
   uint32_t Data_0xec; //236
   uint32_t Data_0xf0; //240
   uint32_t Data_0xf4; //244
   uint32_t Data_0xf8; //248
   uint32_t Data_0xfc; //252
   uint32_t Data_0x100; //256
   uint32_t Data_0x104; //260
   uint32_t Data_0x108; //264
   uint32_t Data_0x10c; //268
   uint32_t Data_0x110; //272
   uint32_t Data_0x114; //276
   uint32_t Data_0x118; //280
   uint32_t Data_0x11c; //284
   uint32_t Data_0x120; //288
   uint32_t Data_0x124; //292
   uint32_t Data_0x128; //296
   uint32_t Data_0x12c; //300
   uint32_t Data_0x130; //304
   uint32_t Data_0x134; //308
   uint32_t Data_0x138; //312
   uint32_t Data_0x13c; //316
   uint32_t Data_0x140; //320
   uint32_t Data_0x144; //324
   uint32_t Data_0x148; //328
   uint32_t Data_0x14c; //332
   uint32_t Data_0x150; //336
   uint32_t Data_0x154; //340
   uint32_t Data_0x158; //344
   uint32_t Data_0x15c; //348
   uint32_t Data_0x160; //352
   uint32_t Data_0x164; //356
   uint32_t Data_0x168; //360
   uint32_t Data_0x16c; //364
   uint32_t Data_0x170; //368
   uint32_t Data_0x174; //372
   uint32_t Data_0x178; //376
   uint32_t Data_0x17c; //380
   uint32_t Data_0x180; //384
   uint32_t Data_0x184; //388
   int fill_0x188; //0x188
   int fill_0x18c; //0x18c
   uint32_t Data_0x190; //0x190
   uint32_t Data_0x194; //0x194
   uint32_t Data_0x198; //0x198
   uint32_t Data_0x19c; //0x19c
   uint32_t Data_0x1a0; //0x1a0
   uint32_t Data_0x1a4; //0x1a4
   uint32_t Data_0x1a8; //0x1a8
   uint32_t Data_0x1ac; //0x1ac
   uint32_t Data_0x1b0; //0x1b0
   uint32_t Data_0x1b4; //0x1b4
   uint32_t Data_0x1b8; //0x1b8
   uint32_t Data_0x1bc; //0x1bc
   uint32_t Data_0x1c0; //0x1c0
   uint32_t Data_0x1c4; //0x1c4
   uint32_t Data_0x1c8; //0x1c8
   uint32_t Data_0x1cc; //0x1cc
   uint32_t Data_0x1d0; //0x1d0
   int fill_0x1d4[7]; //0x1d4  
   uint32_t Data_0x1f0; //0x1f0
   uint32_t Data_0x1f4; //0x1f4
   uint32_t Data_0x1f8; //0x1f8
   uint32_t Data_0x1fc; //0x1fc
   uint32_t Data_0x200; //0x200
   uint32_t Data_0x204; //0x204
   uint32_t Data_0x208; //0x208
   int fill_0x20c; //0x20c
   uint32_t Data_0x210; //0x210
   int fill_0x214[3]; //0x214
   uint32_t Data_0x220; //0x220
   int fill_0x224[3]; //0x224
   uint32_t Data_0x230; //0x230
   int fill_0x234[3]; //0x234
   uint32_t Data_0x240; //0x240
   uint32_t Data_0x244; //0x244
   uint32_t Data_0x248; //0x248
   uint32_t Data_0x24c; //0x24c
   uint32_t Data_0x250; //0x250
   uint32_t Data_0x254; //0x254
   uint32_t Data_0x258; //0x258
   uint32_t Data_0x25c; //0x25c
   uint32_t Data_0x260; //0x260
   uint32_t Data_0x264; //0x264
   uint32_t Data_0x268; //0x268
   uint32_t Data_0x26c; //0x26c
   uint32_t Data_0x270; //0x270
   uint32_t Data_0x274; //0x274
   int fill_0x278[2]; //0x278   
   uint32_t Data_0x280; //0x280
   uint32_t Data_0x284; //0x284
   int fill_0x288[30]; //0x288
   uint32_t Data_0x300; //0x300
   uint32_t Data_0x304; //0x304
   uint32_t Data_0x308; //0x308
   uint32_t Data_0x30c; //0x30c
   uint32_t Data_0x310; //0x310
   uint32_t Data_0x314; //0x314
   uint32_t Data_0x318; //0x318
   uint32_t Data_0x31c; //0x31c
   uint32_t Data_0x320; //0x320
   uint32_t Data_0x324; //0x324
   uint32_t Data_0x328; //0x328
   uint32_t Data_0x32c; //0x32c
   uint32_t Data_0x330; //0x330
   uint32_t Data_0x334; //0x334
   uint32_t Data_0x338; //0x338
   uint32_t Data_0x33c; //0x33c
   uint32_t Data_0x340; //0x340
   uint32_t Data_0x344; //0x344
   int fill_0x348[2]; //0x348
   uint32_t Data_0x350; //0x350
   uint32_t Data_0x354; //0x354
   int fill_0x358[2]; //0x358
   uint32_t Data_0x360; //0x360
   uint32_t Data_0x364; //0x364
   uint32_t Data_0x368; //0x368
   int fill_0x36c; //0x36c
   uint32_t Data_0x370; //0x370
   uint32_t Data_0x374; //0x374
   uint32_t Data_0x378; //0x378
   uint32_t Data_0x37c; //0x37c
   uint32_t Data_0x380; //0x380
   uint32_t Data_0x384; //0x384
   int fill_0x388[2]; //0x388
   uint32_t Data_0x390; //0x390
   uint32_t Data_0x394; //0x394
   uint32_t Data_0x398; //0x398
   uint32_t Data_0x39c; //0x39c
   uint32_t Data_0x3a0; //0x3a0
   uint32_t Data_0x3a4; //0x3a4
   uint32_t Data_0x3a8; //0x3a8
   uint32_t Data_0x3ac; //0x3ac
   uint32_t Data_0x3b0; //0x3b0
   uint32_t Data_0x3b4; //0x3b4
   uint32_t Data_0x3b8; //0x3b8
   int fill_0x3bc; //0x3bc
   uint32_t Data_0x3c0; //0x3c0
   uint32_t Data_0x3c4; //0x3c4
   int fill_0x3c8[14]; //0x3c8
   uint32_t Data_0x400; //0x400
   uint32_t Data_0x404; //0x404
   uint32_t Data_0x408; //0x408
   uint32_t Data_0x40c; //0x40c
   uint32_t Data_0x410; //0x410
   uint32_t Data_0x414; //0x414
   uint32_t Data_0x418; //0x418
   uint32_t Data_0x41c; //0x41c
   uint32_t Data_0x420[32]; //0x420
   int fill_0x4a0[24]; //0x4a0
   //1280
};


static uint32_t func_21926950(uint32_t r8)
{
   uint32_t res;
   
   if (r8 == 2) res = 1;
   else if (r8 == 3) res = 3;
   else if (r8 == 4) res = 4;
   else res = 0;
   
   return res;
}


/* 21c4a238 - todo */
void fapi_videc_get_ood_info(FAPI_VIDEC_VideoDecoderIsrDataT* r6)
{
   unsigned i;
   
   FAPI_SYS_PRINT_DEBUG(4, "fapi_videc_get_ood_info\n");
    
   unsigned r7 = r6->oodInfo.wPtr;

   volatile struct Struct_1280* r4 = (struct Struct_1280*) 
      (r6->physicalMemoryInfoPtr->oodInfoTableStartAddress) +
      r6->oodInfo.rPtrMemory;

   r6->currVcpbDecTimeMsec = FAPI_TIMER_GetTimeStamp(1000);
   
   r6->oodSerialNum = r6->oodInfo.table[r7].serialNum = r4->Data_0;
   
   unsigned ip = r4->Data_0x400 & 0x3f;
   
   r6->oodInfo.table[r7].afdUserDataActiveFormatFlag =
      (ip & 0x20) >> 5;

   if (r6->oodInfo.table[r7].afdUserDataActiveFormatFlag == 1)
   {
      r6->oodInfo.table[r7].currAfd = r4->Data_0x404 & 0xff;
   }
   else
