/*!
*******************************************************************************
**
** \file        ./fapi/drv/videc/src/drv_videc.h
**
** \brief       Video Decoder Driver.
**
** This file contains the declaration of the Video decoder driver API.
** It is the top level Video driver file for all the video decoders.
**
** \attention   THIS SAMPLE CODE IS PROVIDED AS IS. FUJITSU MICROELECTRONICS
**              ACCEPTS NO RESPONSIBILITY OR LIABILITY FOR ANY ERRORS OR
**              OMMISSIONS.
**
** (C) Copyright 2006-2009 by Fujitsu Microelectronics Europe GmbH
**
*******************************************************************************
*/

#ifndef FAPI_VIDEC_H
    #define FAPI_VIDEC_H

#include <fapi/sys_driver.h>

//*****************************************************************************
//*****************************************************************************
//** Defines and Macros
//*****************************************************************************
//*****************************************************************************
/*
*******************************************************************************
** Defines for general error codes of the module.
*******************************************************************************
*/
/*! Bad parameter passed. */
#define FAPI_VIDEC_ERR_BAD_PARAMETER                                          \
                              (FAPI_VIDEC_MODULE_BASE + FAPI_ERR_BAD_PARAMETER)

    /*!   The TSD23큦 Pes parser 3 is used for PTS extraction.*/
    FAPI_VIDEC_TSD23_PESPARSER_3,
}FAPI_VIDEC_PesParserEnumT;
/*!
*******************************************************************************
** \brief Parameter for defining the environment of operation of
** the video decoder.
*******************************************************************************
*/
typedef enum {
    /*!   Live broadcast environment.*/
    FAPI_VIDEC_LIVE_PLAYBACK_ENVIRONMENT = 0,
    /*!   recorded live PVR environment.*/
    FAPI_VIDEC_PVR_PLAYBACK_ENVIRONMENT = 1
}FAPI_VIDEC_PlaybackEnvironmentEnumT;
/*!
*******************************************************************************
** \brief Parameter for defining the reset type of
** the video decoder.
*******************************************************************************
*/
typedef enum {
    /*!   Software reset of VD.*/
    FAPI_VIDEC_SOFT_RESET = 0,
    /*!   Hard reset of VD, It also causes internal rebooting.*/
    FAPI_VIDEC_HARD_RESET = 1
}FAPI_VIDEC_ResetEnumT;
/*!
*******************************************************************************
** \brief Parameter for defining the reset type of
** the video decoder.
*******************************************************************************
*/
typedef enum {
    /*!   Set mode to normal where the data is fed via TSD.*/
    FAPI_VIDEC_NON_MPEG_IFRAME_MODE = 0,
    /*!   Set mode to Mpeg I frame where the data is fed directly into ES buffer.*/
    FAPI_VIDEC_MPEG_IFRAME_MODE = 1
}FAPI_VIDEC_MpegIFrameModeEnumT;
/*
*******************************************************************************
** \brief Defines if video decoder is to handle progressive or
** Interlace coded material.
*******************************************************************************
*/
typedef enum {
  /* Specifies an unknown interlace or progressive video decoder*/
  FAPI_VIDEC_UNKNOWN_IP = (int32_t)-1,
  /* Interlace decoding mode of video decoder*/
  FAPI_VIDEC_IP_INTERLACE, //0
  /* Progressive decoding mode of video decoder*/
  FAPI_VIDEC_IP_PROGRESSIVE //1
} FAPI_VIDEC_InterlaceProggStateT;

typedef enum {
   Enum_200_a = (int32_t)-1,
   Enum_200_0, //0
} Enum_200;

typedef enum {
   Enum_120_0, //0
   Enum_120_1, //1
} Enum_120;



//*****************************************************************************
//*****************************************************************************
//** Data Structures
//*****************************************************************************
//*****************************************************************************
/*!
*******************************************************************************
** \brief Opening parameters for a Video Decoder.
** It has fields for Video decoder number and decoder type. The
** "decoderNumber" field runs from 0 to Maximum number of Video
** decoders supported.
** The field "decoderType" can be any one of the following:
*******************************************************************************
*/
typedef struct {
    /*! The version of the driver.
    ** \ref FAPI_VIDEC_VersionEnumT "FAPI_VIDEC_VERSION".
    */
    FAPI_VIDEC_VersionEnumT              version; //0
    //! Decoder number to be opened or Index
    FAPI_VIDEC_DecoderNumberEnumT        decoderNumber; //4
    //! Open decoder to decode a stream of this type.
    FAPI_VIDEC_DecoderEnumT              decoderType; //8
    //! Open decoder to decode a stream of this maximum horizontal size.
    FAPI_VIDEC_DecoderFrameBankSizeEnumT decodeFrameBankSizeType; //12
    //! This mode parameter is used for entering or exiting trickmodes.
    FAPI_VIDEC_PlaybackModeEnumT         decoderPlaybackMode; //16
    //! This mode parameter is used for defining live or pvr playback environment.
    FAPI_VIDEC_PlaybackEnvironmentEnumT  decoderPlaybackEnvironment; //20
    //! Option to enable or disable AFD application.
    FAPI_VIDEC_AfdStateEnumT             decoderAfdState; //24
    Enum_120                             Data_28; //28
    
}FAPI_VIDEC_OpenParamsT;
/*!
*******************************************************************************
** \brief Video elementary stream (VES) parameters of a known pid stream.
** The following parameters are updated on invoking the relevant call.
** It is used to know the VES parameters after entropy decoding and then
** if necessary the video decoder can be restarted in correct mode.
*******************************************************************************
*/
typedef struct {
    //! Average  of the stream큦 bitrate
    uint32_t                             vesAverageBitRate; //0
    //! currentbitrate averaged over last 1 second
    uint32_t                             vesCurrBitRate; //4
    //! Aspect Ratio of current decoded frame
    FAPI_VIDEC_AspectRatioEnumT          vesAspectRatio; //8
    //! Frame rate.
    uint32_t                             vesFrameRate; //12
    //! Decoder Latency of video decoding pipeline.
    int64_t                              vesDecoderLatency; //16
    //! This mode parameter is used to define interlace or progressive modes.
    uint32_t                             proggInter; //24
    //! Width of display picture in pixels
    uint32_t                             displayWidth; //28
    //! Width of display picture in pixels
    uint32_t                             displayHeight; //32
    //! Width of current decoded frame in pixels
    uint32_t                             decodedWidth; //36
    //! Height of current decoded frame in lines
    uint32_t                             decodedHeight; //40
    //44
}FAPI_VIDEC_VESParamsT;
/*!
*******************************************************************************
** \brief Status parameters for a Video Decoder.
** These parameters shall be updated on invoking. It can
** also be used to determine the decoder capabilities and the current
** state for diagnostic purposes.
*******************************************************************************
*/
typedef struct {

    /*! Firmware version of the video firmware as in flash.
        The firmware version in the flash is available only if the video decoder
        is already booted.
    */
    uint32_t                             firmwareVersionInFlash; //0
    //! Firmware version of the video firmware that is supported by fapi.
    uint32_t                             firmwareVersionSupported; //4
    //! Decoder type.
    FAPI_VIDEC_DecoderEnumT              decoderType; //8
    //! Memory layout for a maximum sized frame.
    FAPI_VIDEC_DecoderFrameBankSizeEnumT decodeFrameBankSizeType; //12
    //! Width of display picture in pixels
    uint32_t                             displayWidth; //16
    //! Width of display picture in pixels
    uint32_t                             displayHeight; //20
    //! Width of current decoded frame in pixels
    uint32_t                             decodedWidth; //24
    //! Height of current decoded frame in lines
    uint32_t                             decodedHeight; //28
    //! Aspect Ratio of current decoded frame
    FAPI_VIDEC_AspectRatioEnumT          aspectRatio; //32
    //! Aspect Ratio of current decoded frame큦 active video region.
    FAPI_VIDEC_AspectRatioEnumT          activeAspectRatioL0; //36
    //! Aspect Ratio of current decoded frame큦 active video region큦 shoot & protect region.
    FAPI_VIDEC_AspectRatioEnumT          activeAspectRatioL1; //40

    FAPI_VIDEC_InterlaceProggStateT      codedInterlaceProggState; //44
    FAPI_VIDEC_InterlaceProggStateT      readoutInterlaceProggState; //48
    //! AFD associated with the current frame.
    uint32_t                             currAfd; //52
    //Stream variables
    /*! Average bit rate of Video elementary stream in bits per second
        It is averaged since the start of video stream*/
    uint32_t                             vesAverageBitRate; //56
    /*! Current bit rate of Video elementary stream in bits per second
        It is averaged over the last 5 pictures.*/
    uint32_t                             vesCurrBitRate; //60
    /*! Frame rate of the input video elementary stream.*/
    uint32_t                             vesFrameRate; //64    
    //State variables
    //! Boot State
    FAPI_VIDEC_BootStateEnumT            bootState; //68 60
    //! Reset State
    FAPI_VIDEC_HardResetStatesEnumT      resetState; //72 64
    //! Enable State
    FAPI_VIDEC_EnableStatesEnumT         enableState; //76 68
    //! Start State
    FAPI_VIDEC_StartStopStatesEnumT      startState; //80 72
    //! Freeze State
    FAPI_VIDEC_FreezeContinueStateEnumT  freezeState; //84?
    //! Health State
    FAPI_VIDEC_HealthStateEnumT          healthState; //88
    uint32_t Data_92; 
    Enum_200 Data_96;
}FAPI_VIDEC_GetStateT;
/*!
*******************************************************************************
** \brief Status parameters for a Video frame.
** These patameters are updated and the call back API is called.
** This provides the parameters that are obtained after Entropy decoding.
*******************************************************************************
*/
typedef struct {
    uint32_t                             serialNum; //0 705416

    uint32_t                             afdUserDataActiveFormatFlag; //4 705420
    uint32_t                             currAfd; //8 705424

    uint32_t                             ccUserDataProcessCcDataFlag; //12 705428
    uint32_t                             ccUserDataCcCount; //16 705432
    uint32_t                             ccUserDataCcValid[32]; //20 705436
    uint32_t                             ccUserDataCcType[32]; //148
    uint32_t                             ccUserDataCcData1[32]; //276
    uint32_t                             ccUserDataCcData2[32]; //404

    uint32_t                             barUserDataTopBarFlag; //532 705948
    uint32_t                             barUserDataEndOfTopBar; //536 705952
    uint32_t                             barUserDataBotBarFlag; //540 705956
    uint32_t                             barUserDataStartOfBotBar; //544 705960
    uint32_t                             barUserDataLeftBarFlag; //548 705964
    uint32_t                             barUserDataEndOfLeftBar; //552 705968
    uint32_t                             barUserDataRightBarFlag; //556 705972
    uint32_t                             barUserDataStartOfRightBar; //560 705976

    uint32_t                             MPEG2HorizontalSizeValue; //564 705980
    uint32_t                             MPEG2VerticalSizeValue; //568
    uint32_t                             MPEG2AspectRatioInformation; //572
    uint32_t                             MPEG2ProgressiveSequence; //576
    uint32_t                             MPEG2ChromaFormat; //580
    uint32_t                             MPEG2DisplayHorizontalSize; //584
    uint32_t                             MPEG2DisplayVerticalSize; //588
    uint32_t                             MPEG2ClosedGop; //592
    uint32_t                             MPEG2BrokenLink; //596
    uint32_t                             MPEG2PictureCodingType; //600
    uint32_t                             MPEG2PictureStructure; //604
    uint32_t                             MPEG2TopFieldFirst; //608
    uint32_t                             MPEG2RepeatFirstField; //612
    uint32_t                             MPEG2ProgressiveFrame; //616
    uint32_t                             MPEG2FieldSequence; //620

    uint32_t                             H264PicStructurePresentFlag;
    uint32_t                             H264PicStructure;
    uint32_t                             H264BrokenLinkFlag;
    uint32_t                             H264NalUnitType;
    uint32_t                             H264PicWidthInMbsMinus1;
    uint32_t                             H264FrameHeightInMbs;
    uint32_t                             H264ProfileIdc;
    uint32_t                             H264LevelIdc;
    uint32_t                             H264FrameNum;
    uint32_t                             H264TopFieldOrderCount;
    uint32_t                             H264BotFieldOrderCount;
    uint32_t                             H264FieldPicFlag;
    uint32_t                             H264BotFieldFlag;
    uint32_t                             H264AspectRatioInfoPresentFlag;
    uint32_t                             H264AspectRatioIdc;
    uint32_t                             H264SarWidth;
    uint32_t                             H264SarHeight;
    uint32_t                             H264ChromaLocInfoPresentFlag;
    uint32_t                             H264ChromaSampleLocTypeTopField;
    uint32_t                             H264ChromaSampleLocTypeBotField;
}FAPI_VIDEC_EntropyDecInfoStateT;
/*!
*******************************************************************************
** \brief Status parameters for a Video frame.
** These patameters are updated and the call back API is called.
** This provides the parameters that are obtained after video decoding.
*******************************************************************************
*/
typedef struct {
    int32_t                              rPtr; //0
    uint32_t                             serialNum; //4
    uint32_t                             frameBank; //8
    uint32_t                             displayWidth; //12
    uint32_t                             displayHeight; //16
    uint32_t                             decodedWidth; //20
    uint32_t                             decodedHeight; //24
    uint32_t                             displayOrderInfo; //28
    uint32_t                             topFieldSerialNo; //32
    uint32_t                             botFieldSerialNo; //36
    uint32_t                             ptsValidFlag; //40
    uint32_t                             dtsValidFlag; //44
    uint64_t                             pts; //48
    uint64_t                             dts; //56
    //64
}FAPI_VIDEC_VideoDecInfoStateT;
/*!
*******************************************************************************
** \brief Status parameters for a Video frame.
** These patameters are updated and the call back API is called.
** This provides the parameters that are obtained after video decoding.
*******************************************************************************
*/
typedef struct {
    FAPI_VIDEC_AspectRatioEnumT          aspectRatio;
    uint32_t                             frameField;
    uint32_t                             fieldInversion;
    uint32_t                             decodedWidth;
    uint32_t                             decodedHeight;
}FAPI_VIDEC_FrameInfoStateT;

/*!
*******************************************************************************
** \brief Type definition of the entropy decoding callback function.
** This function prototype is used for calling the entropy decoding
