

#include <fapi/sys_services.h>
#include <fapi/drv_intr.h>
#include <fapi/drv_gpio.h>
#include <fapi/drv_timer.h>
#include <fapi/drv_i2c.h>
#include "drv_i2c_priv.h"


struct fapi_i2c_handle;


uint32_t func_21c27174(int);
uint32_t func_21c26de4(int);
int i2cHardwareReceive(struct fapi_i2c_handle* r5, char addr,
      uint8_t* pTxData, unsigned numTxData,
      uint8_t* pRxData, unsigned numRxData);
int i2cHardwareTransmit(struct fapi_i2c_handle* r5, char addr,
      uint8_t* pTxData, unsigned numTxData);
int func_21c254f8(int);
uint32_t func_21c255ac(int);
void i2cHardwareReset(int);
void func_21c2445c(void);
void func_21c24348(void);
void func_21c23f00(void);

int func_21c240a4(struct fapi_i2c_handle*, 
      char, uint8_t*, unsigned, uint8_t*, unsigned);

static struct fapi_i2c_handle* fapi_i2c_get_handle(int);
int32_t fapi_i2c_check_handle(struct fapi_i2c_handle*);


FAPI_SYS_DriverT FAPI_I2C_Driver0 = //21efb1b4
{
      "I2C0",
      FAPI_INTR_I2C0,
      FAPI_SYS_BSR_EXEC_UNDEFINED,
      FAPI_I2C_Init,
      FAPI_I2C_Exit,
      FAPI_I2C_Isr0,
      0,
      0,
      0,
};

FAPI_SYS_DriverT FAPI_I2C_Driver1 = //21efb1d8
{
      "I2C1",
      FAPI_INTR_I2C1,
      FAPI_SYS_BSR_EXEC_UNDEFINED,
      FAPI_I2C_Init,
      FAPI_I2C_Exit,
      FAPI_I2C_Isr1,
      0,
      0,
      0,
};

FAPI_SYS_DriverT FAPI_I2C_Driver2 = //21efb1fc
{
      "I2C2",
      FAPI_INTR_I2C2,
      FAPI_SYS_BSR_EXEC_UNDEFINED,
      FAPI_I2C_Init,
      FAPI_I2C_Exit,
      FAPI_I2C_Isr2,
      0,
      0,
      0,
};


struct fapi_i2c_block
{
   int inUse; //0
   unsigned useCount; //4
   unsigned maxUse; //8
   FAPI_SYS_SemaphoreT semaphore; //12
   int error; //16
   FAPI_SYS_HandleT gpioClk; //20
   FAPI_SYS_HandleT gpioData; //24
   FAPI_I2C_OperationModeT operationMode; //28
   int fill_32; //32
   char* pRxData; //36
   char* pTxData; //40
   int fill_44; //44
   unsigned numRxData; //48
   unsigned numTxData; //52
   int fill_56; //56
   int addr; //60
   uint32_t controlReg0; //64
   uint32_t controlReg1; //68
   uint32_t (*Isr)(int); //72
   //76
};

static struct fapi_i2c_block i2cBlockData[3] = //21efb220
{
      {0,0,4,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,func_21c255ac},
      {0,0,4,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,func_21c255ac},
      {0,0,4,0,0,0,0,2,0,0,0,0,0,0,0,0,0,0,func_21c255ac},
};
static int i2cInitialized = 0; //21f233cc
static FAPI_SYS_SemaphoreT i2cSemaphore = 0; //21f233d0

struct fapi_i2c_handle
{
   int magic; //0
   int inUse; //4
   uint32_t index; //8
   FAPI_I2C_ProtocolT protocol; //12
   FAPI_I2C_OpenParamsT params; //16
   int (*Data_44)(int); //44
   int (*receive)(struct fapi_i2c_handle*, char, uint8_t*, unsigned, uint8_t*, unsigned); //48
   int (*transmit)(struct fapi_i2c_handle*, char, uint8_t*, unsigned); //52
   void (*resetLines)(int); //56
   //60
};

struct fapi_i2c_handle i2cHandleArray[12]; //21f2341c




/* 21c23344 - complete */
int32_t FAPI_I2C_Init(void)
{
   int j;
   FAPI_GPIO_OpenParamsT gpio;
   int32_t i = 0;

   if (i2cInitialized == 1)
   {
      return 0;
   }

   i2cSemaphore = FAPI_SYS_CREATE_SEMAPHORE(1);
   if (i2cSemaphore == 0)
   {
      return FAPI_I2C_ERR_SEMAPHORE_CREATE;
   }

   for (i = 0; i < 3; i++)
   {
      i2cBlockData[i].semaphore = FAPI_SYS_CREATE_SEMAPHORE(1);
   }

   memset(i2cHandleArray, 0, 12*sizeof(struct fapi_i2c_handle));

   for (j = 11; j >= 0; j--)
   {
      i2cHandleArray[j].magic = 0x00693263;
   }

   for (i = 0; i < 3; i++)
   {
      if (i == 0)
      {
         gpio.version = FAPI_GPIO_VERSION;
