

#include <stdio.h>
#include <string.h>
#include <stdarg.h>
#include <stdlib.h>
#include <fapi/sys_services.h>
#if 0
#include "cpu_polling.h"
#include "reg_irq_ctrl.h"
#include "drv_uart.h"
#endif
#include "fapi/drv_mmu.h"
#include "fapi/drv_intr.h"
#include "fapi/drv_gpreg.h"
#include "fapi/drv_timer.h"
#include "fapi/drv_mmu_heap.h"
#include "famos_thread.h"
#include "famos_semaphore.h"
#include "famos_mailbox.h"
#include "famos_mailqueue.h"
#include "famos_timer.h"
#include "famos_interrupt.h"
#include "famos.h"

#if 0

extern void famosSwitchContextFromInterrupt(void);
extern void famosSwitchContextFromEvent(void);

#endif

int Data_21efe4a4; //21efe4a4
int Data_21efe4a8; //21efe4a8
void (*famosIntrFunctionTable[])(int) = //21efe4ac
{
      0,
      ARM1176_INTR_UndefFunction, 
      ARM1176_INTR_SwiFunction,  
      ARM1176_INTR_PrefetchFunction, 
      ARM1176_INTR_AbortFunction, 
      0,
      ARM1176_INTR_IrqFunction,
      ARM1176_INTR_FiqFunction,
};


//int famos_numThreads; //21f71c58 -> famos_thread.c 
//int famos_numMailboxes; //21f71c5c -> famos_mailbox.c
//int famos_numSemaphores; //21f71c60 -> famos_semaphore.c 
struct famos* famos; //21f71c64
struct famos_irq* famos_irq; //21f71c68
famosListDataT* famos_resources; //21f71c6c
struct Struct_21f71c70
{
   int fill_0[128]; //0
   int idleThreadStackBuffer[256]; //512
   int reportThreadStackBuffer[2048]; //1536
   int printThreadStackBuffer[1280]; //9728
   //14848
}* famosStackData; //21f71c70
typedef struct
{
   void (*timerFunctionArray[8])(void); //0
   unsigned timerFunctionCount; //32
   void (*switchFunctionArray[4])(void); //36
   unsigned switchFunctionCount; //52
   //56
} famosHookDataT;
famosHookDataT* famosHookData; //21f71c74
struct famos_thread* famosThreadPtrAct; //21f71c78
struct famos_thread* famosThreadPtrNew; //21f71c7c
//int famos_numMailqueues; //21f71c84 -> famos_mailqueue.c

void* famosTimerHandle; //2206c064
FAPI_TIMER_OpenParamsT famosTimerOpenParams; //2206c068
void (*famos_driver_bsr[32])(void); //2206c094
struct fapi_driver** famos_drivers; //2206c114
void* famosUartLockHandle; //2206c118
struct FAPI_SYS_Services famos_services; //2206c11c
struct famos_thread Data_2206c174; //2206c174
int famos_bsr_flags[32]; //2206c1f0
void* (*famos_driver_isr[32])(void); //2206c270
struct famos_bsr_threads
{
   struct famos_bsr_fifo
   {
      void* p; //0
      void (*bsr)(void*); //4
      //8
   }* fifo; //0
   unsigned fifoSize; //4
   unsigned readPtr; //8
   unsigned writePtr; //12
   unsigned count; //16
   unsigned peak; //20
   struct famos_thread* thread; //24
   //28
} famos_bsr_threads[32]; //2206c2f0


void* famos_malloc_segment(int a, int b);
void* famos_malloc_cached(int a);
void famos_bsr_thread(int a);
void famos_print_report(void);




/* 21c79e00 - complete */
void famos_idle_thread(int a)
{   
#if 0
    int thousend = -1;
#endif

   while (1)
   {
#if 0
       if ((famos->idleCount/1000000) != thousend)
       {
           FAPI_SYS_PRINT_MSG("famos->idleCount: %d\n", famos->idleCount);
           thousend = famos->idleCount/1000000;
       }
#endif
      
      famos->idleCount++;
   }
}


/* 21c79e1c - complete */
void func_21c79e1c(void)
{   
   struct famos_thread* thread = famos_resources->threads;
   
   for (; thread != 0; thread = thread->next)
   {      
      void* event = thread->event;
      
      if (thread->state == FAMOS_THREAD_STATE_EVENTWAIT) 
      {
         if (event != 0)
         {
            if ((thread->event->type == FAMOS_EVENT_TYPE_SEMAPHORE) &&
