/*!
*****************************************************************************
**
** \file        ./fapi/drv/viscale/src/drv_viscale.h
**
** \brief       Video Scaler Driver.
**
** This file contains the declaration of the Video Scaler driver API.
**
** \attention   THIS SAMPLE CODE IS PROVIDED AS IS. FUJITSU MICROELECTRONICS
**              ACCEPTS NO RESPONSIBILITY OR LIABILITY FOR ANY ERRORS OR
**              OMMISSIONS.
**
** (C) Copyright 2006-2009 by Fujitsu Microelectronics Europe GmbH
**
*****************************************************************************
*/
#ifndef FAPI_VISCALE_H
    #define FAPI_VISCALE_H

#include <fapi/sys_driver.h>

//***********************************************************************
//***********************************************************************
//** Defines and Macros
//***********************************************************************
//***********************************************************************
/*
*************************************************************************
** Defines for general error codes of the module.
*************************************************************************
*/
/*! Bad parameter passed. */
#define FAPI_VISCALE_ERR_BAD_PARAMETER                                  \
                      (FAPI_VISCALE_MODULE_BASE + FAPI_ERR_BAD_PARAMETER)
/*! Memory allocation failed. */
#define FAPI_VISCALE_ERR_OUT_OF_MEMORY                                  \

****************************************************************************
** \brief Enumeration type for user selection of plane order.
****************************************************************************
*/
typedef enum {
    /*! Selects the Video data to be presented onto the relevant plane.*/
    FAPI_VISCALE_VIDEO_ON_PLANE = 0,
    /*! Selects the osd1 data to be presented onto the relevant plane.*/
    FAPI_VISCALE_OSD1_ON_PLANE = 1,
    /*! Selects the osd2 data to be presented onto the relevant plane.*/
    FAPI_VISCALE_OSD2_ON_PLANE = 2,
    /*! Selects the Cursor data to be presented onto the relevant plane.*/
    FAPI_VISCALE_CURSOR_ON_PLANE = 3
}FAPI_VISCALE_PlaneDataSelectorEnumT;
/*!
*******************************************************************************
** \brief Enumerated types for Hnadling of Wss signal on analog SD encoder.
*******************************************************************************
*/
typedef enum {
    /*!   Unknown handling state of Wss Signal.*/
    FAPI_VISCALE_UNKNOWN_WSS_STATE = (int32_t)-1,
    /*!   User defined Wss signal  is 1.*/
    FAPI_VISCALE_WSS_ENABLE_4_3_FULLFORMAT = 1,
    /*!   User defined Wss signal  is 8.*/
    FAPI_VISCALE_WSS_ENABLE_14_9_CENTRE = 8,
    /*!   User defined Wss signal  is 13.*/
    FAPI_VISCALE_WSS_ENABLE_16_9_BOX_CENTRE = 13,
    /*!   User defined Wss signal  is 11.*/
    FAPI_VISCALE_WSS_ENABLE_16_9_BOX_GT_CENTRE = 11,
    /*!   User defined Wss signal  is 7.*/
    FAPI_VISCALE_WSS_ENABLE_4_3_FULL_FORMAT = 7,
    /*!   User defined Wss signal  is 14.*/
    FAPI_VISCALE_WSS_ENABLE_16_9_ANAMORPHIC = 14,
    /*!   Wss process is executed as defined in the stream.*/
    FAPI_VISCALE_WSS_ENABLE_AUTO = 16,
    /*!   The Wss Signaling is disabled.*/
    FAPI_VISCALE_WSS_DISABLE = 0
}FAPI_VISCALE_WssStateEnumT;

//***********************************************************************
//***********************************************************************
//** Local defines
//***********************************************************************
//***********************************************************************
#define FAPI_VISCALE_DisplayAspectRatioEnumT                            \
                                            FAPI_VISCALE_AspectRatioEnumT

//***********************************************************************
//***********************************************************************
//** Data types
//***********************************************************************
//***********************************************************************
/*!
*************************************************************************
** \brief
** This data structure covers all parameters which are need to be
** specified for each scaler object. There are 4 hardware scaler IPs
** in one software scaler object. This data structure has parameters
** for scaling the Video at the video decoder output ONLY.
*************************************************************************
*/
typedef struct {

    //! These are the fields used for setting the Vo scaler.
    //! Enable/Disable the layer.
    uint32_t                             layerEnable; //0
    //! Describes the layout of OSD in the osd memory.
    FAPI_VISCALE_OsdLayoutEnumT          osdLayout; //4
    //! OSD Mode.
    FAPI_VISCALE_OsdModeEnumT            osdMode; //8
    //! Cursor Mode.
    FAPI_VISCALE_CursorModeEnumT         cpMode; //12
    //! Number of tiles in the horizontal direction in the cursor.
    uint32_t                             cpTileNumX; //16
    //! Number of tiles in the vertical direction in the cursor.
    uint32_t                             cpTileNumY; //20
    //! Base pointer to picture to be displayed. An address in Virtual space is expected.
    uint32_t                             picBase; //24
    //! Frame or field to be used
    uint32_t                             frameField; //28
    //! Flag to enable using the global alpha.
    uint32_t                             useGlobalAlpha; //32
    //! global alpha
    uint32_t                             globalAlpha; //36
    //! Cursor/OSD3 picture to be displayed
    uint32_t                             hilightOnOff; //40
    /*! Colour look up table for OSD1,OSD2 and Cursor Plane only.
        Only 256 colours in clut palett are allowed.*/
    uint32_t                             colourLut[256]; //44
    /*! diMode is the descriptor for deinterlacing Mode.
        It is calculated internally and the application must NOT
        Modify this field.*/
    uint32_t                             diMode; //1068
    /*! fieldInversion is the descriptor for indicating reverse field orders.
        It is calculated internally and the application must NOT
        Modify this field.*/
    uint32_t                             fieldInversion; //1072
    /*! Uncropped input picture width. Cropping is allowed only on
        Video plane and OSDs but not on Cursor plane. For OSDs
        the picture width should be memory burst (128 Byte) alligned.*/
    uint32_t                             inputPicWidth; //1076
    /*! Uncropped input picture height. Cropping is allowed only on
        Video plane and OSDs but not on cursor plane.*/
    uint32_t                             inputPicHeight; //1080


    /*! Input picture start pixel position used for cropping on video plane.
        Cropping at top left corner is allowed for Video plane only,
        for OSD and Cursor it s set to 0 internally.*/
    uint32_t                             inputWindowX0; //1084
    /*! Input picture start line position used for cropping on video plane.
        Cropping at top left corner is allowed for Video plane only,
        for OSD and Cursor it s set to 0 internally.*/
    uint32_t                             inputWindowY0; //1088
    /*! Input picture width in terms of luma pixels used for cropping.
        For Cursor plane it is equal to picture width.*/
    uint32_t                             inputWindowWidth; //1092
    /*! Input picture height in terms of luma lines used for cropping.
        For Cursor plane it is equal to picture height.*/
    uint32_t                             inputWindowHeight; //1096

    //! Output picture start position in horizontal direction
    uint32_t                             outputWindowX0; //1100
    //! Output picture start position in vertical direction
    uint32_t                             outputWindowY0; //1104
    /*! Output picture width in terms of luma pixels after scaling.
        For Cursor plane it is equal to picture width as no scaling is
        supported on cursor plane.*/
    uint32_t                             outputWindowWidth; //1108
    /*! Output picture height in terms of luma lines after scaling.
        For Cursor plane it is equal to picture height as no scaling is
        supported on cursor plane.*/
    uint32_t                             outputWindowHeight; //1112
    //1116
} FAPI_VISCALE_ScalerParamsT;
/*!
*************************************************************************
** \brief Parameters that have changed are intimated by this structure.
*************************************************************************
*/
typedef struct {
    /*! Coded Aspect ratio of the frame*/
    FAPI_VISCALE_AspectRatioEnumT        codedAspectRatio; //0
    /*! Display Aspect ratio*/
    FAPI_VISCALE_AspectRatioEnumT        displayAspectRatio; //4
    /*! User defined scaling method*/
    FAPI_VISCALE_ScalingMethodEnumT      scalingMethod; //8
    /*! Current and new value of the Afd*/
    uint32_t                             currAfd; //12
    /*! Current and new value of the Wss*/
    uint32_t                             currWss; //16
    //20
} FAPI_VISCALE_ParamChangeInfoT;
/*!
*************************************************************************
** \brief Open parameters for the Video Scaler driver.
** This data structure covers all parameters which are need to be
** specified when an instance of the driver is opened.
*************************************************************************
*/
typedef struct {
    /*!
    ** The version of the driver.
    ** \ref FAPI_VISCALE_VersionEnumT "FAPI_VISCALE_VERSION".
    */
    FAPI_VISCALE_VersionEnumT version; //0
    //! Open VO,OSD1,OSD2,SD or CP scaler type
    FAPI_VISCALE_ScalerEnumT  scalerType; //4
    //! PAL,NTSC..encoder.
    FAPI_VISCALE_EncoderEnumT encoderType; //8
    //12
} FAPI_VISCALE_OpenParamsT;
/*!
*************************************************************************
** \brief Type definition of the video scaling callback function.
