/*
*****************************************************************************
**
** \file        ./fapi/drv/viscale/src/drv_viscale_priv.h
** 
** \brief       Privately used header file.
**
** This file contains the declaration of the private data of Viscale driver.
**
** \attention   THIS SAMPLE CODE IS PROVIDED AS IS. FUJITSU MICROELECTRONICS
**              ACCEPTS NO RESPONSIBILITY OR LIABILITY FOR ANY ERRORS OR
**              OMMISSIONS.
**
** (C) Copyright 2006-2009 by Fujitsu Microelectronics Europe GmbH
**
*****************************************************************************
*/

#ifndef FAPI_VISCALE_PRIV_H
    #define FAPI_VISCALE_PRIV_H

//**************************************************************************
//**************************************************************************
//** Defines and Macros
//**************************************************************************
//**************************************************************************
//!************* BASE ADDRESSES OF SCALERS *********************************
#define FAPI_VISCALE_BASE_ADDRESS_VIDEO_SCALER_0 FIO_ADDRESS(VO, 0xCB000000)
#define FAPI_VISCALE_BASE_ADDRESS_OSD_SCALER_1   FIO_ADDRESS(VO, 0xCB004000)
#define FAPI_VISCALE_BASE_ADDRESS_OSD_SCALER_2   FIO_ADDRESS(VO, 0xCB008000)
#define FAPI_VISCALE_BASE_ADDRESS_SD_SCALER_3    FIO_ADDRESS(VO, 0xCB00C000)
#define FAPI_VISCALE_BASE_ADDRESS_CP_SCALER_4    FIO_ADDRESS(VO, 0xCB010000)

    FAPI_VISCALE_HD_SCALER_MODE_1920x1080x2997P = 4,
    //! Predefined hd scaler mode to scale any pic to 1920x1080p.
    FAPI_VISCALE_HD_SCALER_MODE_1920x1080x30P = 5,
    //! Predefined hd scaler mode to scale any pic to 1920x1080i.
    FAPI_VISCALE_HD_SCALER_MODE_1920x1080x50I = 6,
    //! Predefined hd scaler mode to scale any pic to 1920x1080i.
    FAPI_VISCALE_HD_SCALER_MODE_1920x1080x5994I = 7,
    //! Predefined hd scaler mode to scale any pic to 1920x1080i.
    FAPI_VISCALE_HD_SCALER_MODE_1920x1080x60I = 8,
    //! Predefined hd scaler mode to scale any pic to 1280x720p.
    FAPI_VISCALE_HD_SCALER_MODE_1280x720x2397P = 9,
    //! Predefined hd scaler mode to scale any pic to 1280x720p.
    FAPI_VISCALE_HD_SCALER_MODE_1280x720x24P = 10,
    //! Predefined hd scaler mode to scale any pic to 1280x720p.
    FAPI_VISCALE_HD_SCALER_MODE_1280x720x25P = 11,
    //! Predefined hd scaler mode to scale any pic to 1280x720p.
    FAPI_VISCALE_HD_SCALER_MODE_1280x720x2997P = 12,
    //! Predefined hd scaler mode to scale any pic to 1280x720p.
    FAPI_VISCALE_HD_SCALER_MODE_1280x720x30P = 13,
    //! Predefined hd scaler mode to scale any pic to 1280x720p.
    FAPI_VISCALE_HD_SCALER_MODE_1280x720x50P = 14,
    //! Predefined hd scaler mode to scale any pic to 1280x720p.
    FAPI_VISCALE_HD_SCALER_MODE_1280x720x5994P = 15,
    //! Predefined hd scaler mode to scale any pic to 1280x720p.
    FAPI_VISCALE_HD_SCALER_MODE_1280x720x60P = 16,
    //! Predefined hd scaler mode to scale any pic to 720x576i.
    FAPI_VISCALE_HD_SCALER_MODE_720x576x50I = 17,
    //! Predefined hd scaler mode to scale any pic to 720x576p.
    FAPI_VISCALE_HD_SCALER_MODE_720x576x50P = 18,
    //! Predefined hd scaler mode to scale any pic to 720x480i.
    FAPI_VISCALE_HD_SCALER_MODE_720x480x5994I = 19,
    //! Predefined hd scaler mode to scale any pic to 720x480p.
    FAPI_VISCALE_HD_SCALER_MODE_720x480x5994P = 20,
    //! Predefined sd scaler mode for LCD.
    FAPI_VISCALE_HD_SCALER_MODE_LCD_640x480x50P_LQ080V3DG01 = 21,
    //! Predefined sd scaler mode for LCD.
    FAPI_VISCALE_HD_SCALER_MODE_LCD_1024x768x50P_SVA150XG10TB = 22
}FAPI_VISCALE_HdScalerModeEnumT;
/*!
****************************************************************************
** \brief Enumeration type for User scaling request.
****************************************************************************
*/
typedef enum {
    //! User Request served.
    FAPI_VISCALE_USER_SCALER_REQUEST_DONE = 0,
    //! User Request served.
    FAPI_VISCALE_AUTO_SCALER_REQUEST_DONE = 1,
    //! User request pending.
    FAPI_VISCALE_USER_SCALER_REQUEST = 2,
    //! User request pending.
    FAPI_VISCALE_AUTO_SCALER_REQUEST = 3
}FAPI_VISCALE_ScalerRequestTypeEnumT;
//***********************************************************************
//***********************************************************************
//** Data types
//***********************************************************************
//***********************************************************************
typedef struct{
    uint32_t                                          startX0; //0
    uint32_t                                          startY0; //4
    uint32_t                                          horSize; //8
    uint32_t                                          verSize; //12

    // Some SD specific stuff
    uint32_t                                          sdHorWriteStart; //16
    uint32_t                                          sdHorWriteStop; //20
    uint32_t                                          sdDispcvbshorstartstop; //24
    //28
}FAPI_VISCALE_ActiveRegionDataT;
/*
*************************************************************************
** \brief The Data Structure containing the fields for mapping the user 
** and autoscaler requests onto the Vo Scaler´s H/W.
** \sa FAPI_VISCALE_VideoScalerHandleT
*************************************************************************
*/
typedef struct {
    uint32_t                                          diMode; //0
    uint32_t                                          fieldInversion; //4
    uint32_t                                          frameField; //8
    uint32_t                                          inputPicWidth; //12
    uint32_t                                          inputPicHeight; //16
    uint32_t                                          inputWindowX0; //20
    uint32_t                                          inputWindowY0; //24
    uint32_t                                          inputWindowWidth; //28
    uint32_t                                          inputWindowHeight; //32
    uint32_t                                          outputWindowX0; //36
    uint32_t                                          outputWindowY0; //40
    uint32_t                                          outputWindowWidth; //44
    uint32_t                                          outputWindowHeight; //48
    //52
}FAPI_VISCALE_VoRequestMapsDataT;
/*
*************************************************************************
** \brief The Data Structure containing the fields for mapping the
** special handling of SD scaler.
*************************************************************************
*/
typedef struct {
    uint32_t                                          inputHorStart; //0
    uint32_t                                          inputHorStop; //4
    uint32_t                                          inputVerStart; //8
    uint32_t                                          inputVerStop; //12
    uint32_t                                          outputHorStart; //16
    uint32_t                                          outputHorStop; //20
    uint32_t                                          outputVerStart; //24
    uint32_t                                          outputVerStop; //28
    uint32_t                                          sdHorWriteStart; //32
    uint32_t                                          sdHorWriteStop; //36
    uint32_t                                          sdDispcvbshorstartstop; //40
    //44
}FAPI_VISCALE_SdRequestMapsDataT;
/*
*************************************************************************
** \brief The Data Structure containing the feilds for operating the
** Scaler inside the ISR.
** \sa FAPI_VISCALE_VideoScalerHandleT
*************************************************************************
*/
typedef struct {

    //Hor Filter variables
    uint32_t                                          hSize; //0
    int32_t                                           initalShift; //4
    uint32_t                                          horDispPixel; //8
    uint32_t                                          horReadPixel; //12

    uint32_t                                          hStartPos; //16
    uint32_t                                          horAddPhase; //20
    uint32_t                                          horFilterOn; //24
    uint32_t                                          horFilterUp; //28
    uint32_t                                          horD; //32
    uint32_t                                          horN; //36

    //Field invert order indicator
    uint32_t                                          fieldInversion; //40

    //Ver Filter variables
    uint32_t                                          vStartPos; //44
    uint32_t                                          verAddPhase; //48
    uint32_t                                          verFilterOn; //52
    uint32_t                                          verFilterUp; //56
    uint32_t                                          verD; //60
    uint32_t                                          verN; //64

    //Output window variables
    uint32_t                                          horStart; //68
    uint32_t                                          horStop; //72
    uint32_t                                          verStart; //76
    uint32_t                                          verStop; //80

    //Sd Filter maps
    FAPI_VISCALE_SdRequestMapsDataT                   sdScalerReq; //84

    //Coefficients
    uint32_t                                          coefficients[128]; //128

} FAPI_VISCALE_VideoFilterSettingsDataT;
/*
*****************************************************************************
** \brief The Data Structure containing the feilds for operating the
** Scaler ISR.
** \sa FAPI_VISCALE_VideoScalerHandleT
****************************************************************************
*/
typedef struct {

    //ISR State machine type.
    uint32_t                                          inUse; //0
    //ISR State machine type.
    FAPI_VISCALE_ScalerEnumT                          scalerType; //4

    //Fading State variables
    FAPI_VISCALE_InternalVideoFadingModeEnumT         iFadeState; //8
    int32_t                                           iFadeLimitValue; //12
    int32_t                                           iFadeCurrValue; //16
    int32_t                                           iFadeStepSize; //20

    //Enable/Disable State variables
    FAPI_VISCALE_EnableStatesEnumT                    iEnableState; //24

    //Request State variables
    FAPI_VISCALE_ScalerRequestTypeEnumT               iUserScalerReqState; //28
    FAPI_VISCALE_ScalerRequestTypeEnumT               iAutoScalerReqState; //32

    //Filter State variables
    FAPI_VISCALE_FilterStatesEnumT                    iFilterState; //36
    FAPI_VISCALE_VideoFilterSettingsDataT             iFilter; //40

    // Callbacks
    FAPI_VISCALE_ParamChangeInfoT                     paramChangeInfo; //680
    FAPI_VISCALE_ParamChangeCallbackT                 paramChangeCbk; //700
    void*                                             paramChangeOptData; //704
    //708
} FAPI_VISCALE_VideoScalerIsrDataT;
/*
*************************************************************************
** \brief Handle parameters for the Video Scaler driver.
** This data structure covers all parameters which need to be specified
** when an instance of the driver is opened.It also has feilds for Video
** scaler signature and scaler´s base address.
*************************************************************************
*/
typedef struct {
    uint32_t                                inUse; //0
    char_t                                  coreName[32]; //4
    uint64_t                                coreID; //36
    uint32_t                                baseAddress; //44
    FAPI_VISCALE_OpenParamsT                opParams; //48
    FAPI_VISCALE_SdScalerModeEnumT          sdMode; //60
    FAPI_VISCALE_HdScalerModeEnumT          hdMode; //64
    uint32_t                                pixPerBurst; //68
    uint32_t                                bitsPerPix; //72
    FAPI_VISCALE_ScalerParamsT              scalerParams; //76
    FAPI_VISCALE_ScalerParamsT              userRawScalerReq; //1192
    FAPI_VISCALE_AspectRatioEnumT           inputAspectRatio; //2308
    FAPI_VISCALE_AspectRatioEnumT           inputActiveAspectRatioL0; //2312
    FAPI_VISCALE_AspectRatioEnumT           inputActiveAspectRatioL1; //2316
    FAPI_VISCALE_AspectRatioEnumT           userDisplayAspectRatio; //2320
    FAPI_VISCALE_AspectRatioEnumT           displayAspectRatioL0; //2324
    FAPI_VISCALE_AspectRatioEnumT           displayAspectRatioL1; //2328
    FAPI_VISCALE_ScalingMethodEnumT         userScalingMethod; //2332
    FAPI_VISCALE_ScalingMethodEnumT         scalingMethod; //2336
    FAPI_VISCALE_ScalingMethodEnumT         fill_2340; //2340
    FAPI_VISCALE_VoRequestMapsDataT         afdScalerReq; //2344
    FAPI_VISCALE_VoRequestMapsDataT         userScalerReq; //2396
    FAPI_VISCALE_VoRequestMapsDataT         smScalerReq; //2448
    FAPI_VISCALE_VoRequestMapsDataT         autoScalerReq; //2500
    uint32_t                                currAfd; //2552
    FAPI_VISCALE_WssStateEnumT              userWssState; //2556
    FAPI_VISCALE_WssStateEnumT              wssState; //2560
    uint32_t                                currWss; //2564
//    int fill; //2564
    FAPI_VISCALE_VideoScalerIsrDataT*       isrDataPtr; //2568

    int32_t  (*Start)(FAPI_SYS_HandleT handle, 
                             FAPI_VISCALE_ScalerParamsT* scaleParamsPtr); //2572
    int32_t  (*Stop)(FAPI_SYS_HandleT handle); //2576
    int32_t  (*EnableDisable)(FAPI_SYS_HandleT handle,
                                   FAPI_VISCALE_ParameterModeEnumT mode); //2580
    uint32_t (*Alpha)(FAPI_SYS_HandleT handle,
                   FAPI_VISCALE_ParameterModeEnumT mode, uint32_t level); //2584
    int32_t  (*Resize)(FAPI_SYS_HandleT handle,
                             FAPI_VISCALE_ScalerParamsT* scaleParamsPtr); //2588
    int32_t  (*Hilight)(FAPI_SYS_HandleT handle,
                                   FAPI_VISCALE_ParameterModeEnumT mode); //2592
    int32_t  (*AutoPlaneFading)(FAPI_SYS_HandleT handle,
                           FAPI_VISCALE_VideoFadingModeEnumT fadingMode); //2596
    int32_t  (*AutoPlaneFadingStepSize)(FAPI_SYS_HandleT handle,
