
#define DEBUG 0


#include <fapi/sys_services.h>
#include <fapi/drv_gpio.h>
#include <fapi/drv_upi.h>
#include <fapi/drv_flash.h>
#include <fapi/drv_flash_priv.h>



FAPI_SYS_DriverT FAPI_FLASH_Driver = //21efa6ec
{
      "FLASH",
      -1,
      FAPI_SYS_BSR_EXEC_UNDEFINED,
      FAPI_FLASH_Init,
      FAPI_FLASH_Exit,
      0,
      0,
      0,
      0,
};



static FAPI_SYS_SemaphoreT flashSemaphore = 0; //21f21efc
static uint32_t flashInitialized = 0; //21f21ef8
static int Data_21efa6e0 = 0x80000000; //21efa6e0
static int Data_21efa6e4 = 0x80000000; //21efa6e4
static int Data_21efa6e8 = 0x80000000; //21efa6e8
static FAPI_SYS_HandleT flashNFlashUpiHandle; //21f21f34
static FAPI_SYS_HandleT flashPFlashUpiHandle; //21f21f30

static flashBlockT flashBlockArray[3] = //21b6a3e8
{
   {0, FAPI_FLASH_DEVICE_PFLASH, 0, 0,
    /*{func_21c1c75c, //pflashDetectChip
     * d8c6c121 //pflashEraseChip
     * dcc5c121 //pflashEraseSector
     * b0bdc121 //pflashReadSector
     * b0c3c121 //pflashWriteSector
     * ccbcc121 //pflashReadDirect
     * f8c1c121}*/}, //pflashWriteDirect

   {0, FAPI_FLASH_DEVICE_SFLASH, 0, 0,
   sflashDetectChip,
   sflashEraseChip,
   sflashEraseSector,
   sflashReadSector,
   sflashWriteSector,
   sflashReadDirect,
   sflashWriteDirect,
   },

   {0, FAPI_FLASH_DEVICE_NFLASH, 0, 0,
    /*{d0e1c121 //nflashDetectChip
     * 28dcc121 //nflashEraseChip
     * 7cdbc121 //nflashEraseSector
     * 0cd8c121 //nflashReadSector
     * 24dfc121 //nflashWriteSector
     * 5cd6c121 //nflashReadDirect
     * 44ddc121}*/}, //nflashWriteDirect
};

static FAPI_GPIO_OpenParamsT flashGpioParams[9] = //21efa794
{
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_IN_SFLASH_DATA, 0},
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_OUT_SFLASH_HOLD, 0},
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_OUT_SFLASH_CS, 0},
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_OUT_SFLASH_CLK, 0},
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_OUT_SFLASH_DATA, 0},
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_OUT_UPI_ADDRX0, 0},
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_OUT_UPI_ADDRX1, 0},
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_OUT_UPI_ADDRX2, 0},
   {FAPI_GPIO_VERSION, FAPI_GPIO_PIN_AUTODETECT, FAPI_GPIO_OUT_UPI_ADDRX3, 0},
};


struct Struct_21efa710;

struct fapi_flash_handle
{
   int magic; //0
   int inUse; //4
   FAPI_FLASH_OpenParamsT Data_8; //8
   struct Struct_21efa710* Data_32; //32
   int Data_36; //36
   int Data_40; //40
   uint32_t Data_44; //44
   uint32_t Data_48; //48
   //52
};


struct Struct_21efa9bc
{
   char* name; //0
   unsigned numPartitions; //4
   struct fapi_flash_partition
   {
      unsigned sectorCount; //0
      unsigned sectorSize; //4
      //8
   } partitions[5]; //8
   int manufacturerId; //48
   int Data_52; //52
   int fill_56; //56
   int fill_60; //60
   int fill_64; //64
   //68
};


struct Struct_21efa710_Inner_12
{
   int Data_0; //0
   unsigned totalSize; //4
   unsigned totalSectors; //8
   int Data_12; //12
   int Data_16; //16
   struct Struct_21efa9bc* chip; //20
   unsigned* sectorStart; //24
   unsigned* sectorBytes; //28
   char* sectorProtect; //32
   unsigned* buffer; //36
   int currSectorIndex; //40
   int currSectorStart; //44
   unsigned currSectorBytes; //48
   int Data_52; //52
   //56
};


struct Struct_21efa710
{
   int Data_0; //0
   int Data_4; //4
   FAPI_SYS_SemaphoreT semaphore; //8
   struct Struct_21efa710_Inner_12* Data_12; //12
   int (*detectChip)(struct Struct_21efa710_Inner_12**, int); //16
   int32_t (*eraseChip)(struct Struct_21efa710_Inner_12*, int); //20
   int32_t (*eraseSector)(struct Struct_21efa710_Inner_12*, int); //24
   int32_t (*readSector)(struct Struct_21efa710_Inner_12*, int); //28
   int (*writeSector)(struct Struct_21efa710_Inner_12*, int); //32
   int (*readDirect)(struct Struct_21efa710_Inner_12*,
         int, int, int, void*, int); //36
   int32_t (*writeDirect)(struct Struct_21efa710_Inner_12*,
         int, int, int, const void*, int); //40
   //44
};


int fapi_flash_enables[3]; //21f21f00
int fapi_flash_upi_index[3]; //21f21eec
void* fapi_flash_gpio_handles[9]; //21f21f0c
flashHandleT flashHandleArray[16]; //21f21f38


static void func_21c1a4bc(void);
static int fapi_flash_open_gpio(void);
static void fapi_flash_close_gpio(void);
static void func_214e2338(void);
/*static*/ int32_t flashFlushBuffer(struct Struct_21efa710*, int);
