/*!
*****************************************************************************
**
** \file        ./applications/smartgo-hd/fgs/src/fgs.c
**
** \brief       content description.
**
** \attention   THIS SAMPLE CODE IS PROVIDED AS IS. FUJITSU MICROELECTRONICS
**              ACCEPTS NO RESPONSIBILITY OR LIABILITY FOR ANY ERRORS OR
**              OMMISSIONS.
**
** (C) Copyright 2006-2010 by Fujitsu Microelectronics Europe GmbH
** (C) Copyright 2010 by Fujitsu Semiconductor Europe GmbH
**
*****************************************************************************
**
** \note The following LINT statements have been suppressed:
**
** - Warning 641: Converting enum 'anyEnum' to int
** - Info    713: Loss of precision (assignment) (unsigned int to short).
** - Info    732: Loss of sign (assignment) (int to unsigned short).
** - Info    737: Loss of sign in promotion from int to unsigned int.
** - Note    961: Violates MISRA 2004 Advisory Rule 12.1, dependence placed on
**                C's operator precedence.
**
*****************************************************************************
*/
/*lint -save -e641 -e713 -e732 -e737 -e961 */

/*---------------------------------------------------------------------------*/
/* include files                                                             */
/*---------------------------------------------------------------------------*/
#include "fgs.h"

/*---------------------------------------------------------------------------*/
/* private data declarations                                                 */
/*---------------------------------------------------------------------------*/


/*---------------------------------------------------------------------------*/
/* local defines                                                             */
/*---------------------------------------------------------------------------*/

#define FGS_STRBUFCHARS      128
#define FGS_STRBUFCHARSET    SYS_CHARSET_ISO_10646   //!< Character set used.

#define FGS_HIDE_AREA_MAX   32

/*---------------------------------------------------------------------------*/
/* local datatypes                                                           */
/*---------------------------------------------------------------------------*/

typedef struct
{
    /* handler installed by GUI */
    FGS_KEY_CB_S        cb;
    FAPI_SYS_HandleT    data;
    fbool_t             blockRep;

    /* handler installed by application */
    FGS_APPKEY_HDL_S    appHdl;

} FGS_KEY_HANDLER_S;

typedef struct
{
    FGS_MEMBER_S* pMember;

} FGS_ORDER_S;

typedef struct
{
    FGS_INIT_S        data;
    uint8_t           numMembers; //40
    FGS_MEMBER_S      member[FGS_MEMBERS_MAX];
    int32_t           focusIdx; //812
    FGS_ORDER_S       order[FGS_MEMBERS_MAX];   //!< Display order (0: top)

    SYS_STRBUF_S      strBuf; //880
    char_t            asciiBuf[FGS_STRBUFCHARS]; //900
    SYS_STRING_S      asciiStr; //1028

    /* key handling data */
    FGS_KEY_HANDLER_S keyHdl[/*FGS_KEY_NUMS*/67];
    FGS_KEY_E         currKey; //2912
    FGS_KEYTYPE_E     currType; //2916
    int8_t            currValue; //2920

    FGS_AREA_S        hideArea[FGS_HIDE_AREA_MAX];
    uint16_t          numAreas;
    //3184
} FGS_INST_S;

/*---------------------------------------------------------------------------*/
/* local data                                                                */
/*---------------------------------------------------------------------------*/

/*static*/ FGS_INST_S*   fgsInst = NULL;
        FGS_DRAWIF_S* fgsDraw = NULL; // external access to draw interface

/*---------------------------------------------------------------------------*/
/* local functions                                                           */
/*---------------------------------------------------------------------------*/

static void    FGS_DrawString          (SYS_STRING_S  itemStr,
                                        uint8_t       itemFont,
                                        uint8_t       itemAlign,
